{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Jono Cooper",
	"language": "en",
	"home_page_url": "https://jono.nz/",
	"feed_url": "https://jono.nz/feed/feed.json",
	"description": "Jono Cooper is a product engineer based in Tāmaki Makaurau. He has a passion for delivering best-in-class products, from vision to execution.",
	"author": {
		"name": "Jono Cooper",
		"url": "https://jono.nz"
	},
	"items": [
		{
			"id": "https://jono.nz/2022/07/15/rapid-kfc/",
			"url": "https://jono.nz/2022/07/15/rapid-kfc/",
			"title": "Auckland’s Rapid KFC Network",
			"content_html": "<p>I spent 30 minutes making a dumb map the other day, but figured it's worth a post here as it went <a href=\"https://www.nzherald.co.nz/lifestyle/hop-on-hop-off-tuck-in-aucklands-rapid-transit-kfc-map/YRDOFXP2V3DSJWJR2BR756SG54/\">somewhat viral</a>.</p>\n<p><img src=\"https://jono.nz/images/kfcmap.webp\" alt=\"Map of Auckland rapid transit stations within walking distance from a KFC\"></p>\n<p>I was mostly just messing around with Photoshop on the iPad editing Auckland Transport's excellent <a href=\"https://at.govt.nz/media/1989560/auckland-s-rapid-transit-network-map.pdf\">rapid transit map</a>. Photoshop on iPad on the other hand, is not so excellent. Hopefully it continues to improve.</p>\n<p>There's a couple of spots that were on the cusp of making the cut - Manukau &amp; Akoranga. It's really not the distance that's the issue for these ones, but the oversized roads that you need to cross. Otahuhu almost made it, but the station is just a bit too far from the town centre. Hopefully one day, the town centre will sprawl all the way to the station.</p>\n<p>There is a general lack of shops integrated into stations in Auckland. With the exception of Britomart, the most you'll get is a coffee stand in the concourse. It's not for a lack of space either, just ambition. Would love to see our stations become more like Hong Kong, or even Sydney.</p>\n<p><img src=\"https://jono.nz/images/kfctweet.webp\" alt=\"Tweet ended up on the KFC instagram story\"></p>\n<p>How many of the KFCs have I actually visited on this map? Only Britomart, Newmarket, Panmure, Sylvia Park, and Auckland Airport. As much as I love KFC, I won't be taking up the challenge to hit all of these in a single day.</p>\n",
			"date_published": "2022-07-15T18:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2021/09/04/samescale/",
			"url": "https://jono.nz/2021/09/04/samescale/",
			"title": "Same Scale",
			"content_html": "<p>Every city is different, and those differences are reflected in our maps. I find it really interesting that our the differences in landscape and urban form manifest themselves in these maps, and it's cool to be able to directly compare two cities side by side.</p>\n<p><img src=\"https://jono.nz/images/samescale.png\" alt=\"Auckland &amp; Sydney Side by Side\"></p>\n<p>However, I've never been particularly happy with the tools that exist to do this. So I made one.</p>\n<p><strong><a href=\"https://scale.waka.app\">scale.waka.app</a></strong></p>\n<h2 id=\"why-its-better\" tabindex=\"-1\">Why it's better? <a class=\"header-anchor\" href=\"https://jono.nz/2021/09/04/samescale/#why-its-better\">#</a></h2>\n<p>I think this is a huge improvement over other tools, as it uses vector maps. This means you can zoom to any fraction (no jump in zoom levels), rotate the maps, and even tilt in 3D. I've also thrown in an option to switch to a satellite view, so you can see some of the differences in land use.</p>\n<p>You can also search for a location, to save you having to scroll around, and it works nicely on mobile too! I've also thrown in a few sample cities that I think are similar.</p>\n<ul>\n<li><em>Sydney &amp; Auckland:</em> Both coastal cities in Oceania, founded in a similar time period</li>\n<li><em>New York &amp; Hong Kong:</em> Both tiny, super dense island cities!</li>\n<li><em>Canberra &amp; Washington, D.C.</em>: Both planned federal capitals, created for similar reasons</li>\n</ul>\n<h2 id=\"was-it-hard-to-make\" tabindex=\"-1\">Was it hard to make? <a class=\"header-anchor\" href=\"https://jono.nz/2021/09/04/samescale/#was-it-hard-to-make\">#</a></h2>\n<p>Not really! I did most of it in a morning. It was basically a matter of creating two <a href=\"https://mapbox.com\">Mapbox</a> maps, and syncing the events between them.</p>\n<p>The hardest part was syncing the zooms. Because of Web Mercator projection, the same zoom level at different latitudes doesn't necessarily mean things will be the same scale. I spent (admittedly too much) time on coming up with an equation to translate the zoom levels between the two maps. If you're curious, here's the equation:</p>\n<blockquote>\n<p>zoom2 = log<sub>2</sub>( |cos(lat2)| / |cos(lat1)| / 2<sup>zoom1</sup> )</p>\n</blockquote>\n<p>Other than that, it was pretty straightforward! The code is open source—you can go take a look over at <a href=\"https://github.com/consindo/samescale\">https://github.com/consindo/samescale</a>.</p>\n<h2 id=\"is-it-finished\" tabindex=\"-1\">Is it finished? <a class=\"header-anchor\" href=\"https://jono.nz/2021/09/04/samescale/#is-it-finished\">#</a></h2>\n<p>Yes. It's nice to actually be able to call a piece of software finished.</p>\n<p><strong><a href=\"https://scale.waka.app\">scale.waka.app</a></strong></p>\n",
			"date_published": "2021-09-04T18:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2020/08/23/waka-commuter/",
			"url": "https://jono.nz/2020/08/23/waka-commuter/",
			"title": "Waka Commuter",
			"content_html": "<p>I recently built a data visualization for a <a href=\"https://www.stats.govt.nz/news/winner-announced-for-2018-census-commuter-data-visualisation-competition\">NZ Census data competition</a>, and ended up winning! I figured I would go through some of the thinking behind it, as well as how I built it.</p>\n<jc-center>\n  <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Congrats <a href=\"https://twitter.com/consindo?ref_src=twsrc%5Etfw\">@consindo</a>! Using Census data, Jono has developed a very cool way of showing where people all over NZ (usually) travel to and from for work and study. <a href=\"https://t.co/oAamoSmVjB\">https://t.co/oAamoSmVjB</a> <a href=\"https://t.co/ieIv9LbW4h\">https://t.co/ieIv9LbW4h</a></p>&mdash; James Shaw (@jamespeshaw) <a href=\"https://twitter.com/jamespeshaw/status/1294100223547990017?ref_src=twsrc%5Etfw\">August 14, 2020</a></blockquote> <script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</jc-center>\n<h2 id=\"the-idea\" tabindex=\"-1\">The idea <a class=\"header-anchor\" href=\"https://jono.nz/2020/08/23/waka-commuter/#the-idea\">#</a></h2>\n<p>My overall goal with the app was to make the <a href=\"https://datafinder.stats.govt.nz/data/category/census/2018/commuter-view/\">commuter view data</a> as accessible as possible, so I started by creating a visualization familiar to many people: an election map. Elections can be quite binary, so I found that this visual representation translates well to arrivals &amp; departures for a geographical area. While colours are pretty, I also wanted make this tool useful to real people, so I added some additional insights to complement the main map.</p>\n<p><img src=\"https://jono.nz/images/waka-commuter-map.png\" alt=\"Waka Commuter Map View\"></p>\n<p>Upon selecting a region, you're presented with a text summary and a more abstract bubble view of arrivals &amp; departures. This visualization still aims to be roughly spacial, but ignores land area and uses commuter volumes instead. A chart showing the overall travel modes is also included as this can provide additional context to people's travel patterns. Due to data suppression, I was not able to use the commuter view dataset, and used the <a href=\"http://nzdotstat.stats.govt.nz/WBOS/Index.aspx?DataSetCode=TABLECODE8296\">aggregated census data instead</a>.</p>\n<p><img src=\"https://jono.nz/images/waka-commuter-insights.png\" alt=\"Waka Commuter Insights\"></p>\n<p>I included options to filter by arrivals/departures &amp; work/education. Patterns can be quite different, so it's fun to toggle the options and see the visualizations update in real-time! As the SA2 boundaries are small, you can also Ctrl+Click to multi-select and view insights for larger areas (e.g an entire city centre).</p>\n<p>Lastly, I ensured the app worked on mobile devices to make it accessible to the largest number of people. A few features are omitted, but is still useful and should encourage people to try the app on a PC for more detailed insights.</p>\n<h2 id=\"how-i-built-it\" tabindex=\"-1\">How I built it <a class=\"header-anchor\" href=\"https://jono.nz/2020/08/23/waka-commuter/#how-i-built-it\">#</a></h2>\n<p>Quickly. It's not my best work, but I've <a href=\"https://github.com/consindo/commuterview\">open sourced it on GitHub anyway</a>. I had a couple of goals though, and they informed the tech I used.</p>\n<h3 id=\"serverless\" tabindex=\"-1\">Serverless <a class=\"header-anchor\" href=\"https://jono.nz/2020/08/23/waka-commuter/#serverless\">#</a></h3>\n<p>Databases are great, but they can be expensive to run. It's also just something to maintain, and I really want this app to work forever and not worry about it.</p>\n<p>As the dataset doesn't change (except when there's a new Census!), I wrote some scripts to process all the data and output a JSON file for each area unit. You end up with a lot of files (2,474), but it becomes a psuedo-API.</p>\n<p><img src=\"https://jono.nz/images/waka-commuter-api.png\" alt=\"Waka Commuter psuedo-API\"></p>\n<p>I ended up using <a href=\"https://netlify.com\">Netlify</a> to deploy it, mostly because I can't use GitHub pages with more than one custom domain (already using it for this site). I'm impressed though—you just point it to your GitHub repo, it builds everything really quickly, and then kinda just works—SSL etc is all sorted. I'll definitely be using it more in the future.</p>\n<h3 id=\"maps\" tabindex=\"-1\">Maps <a class=\"header-anchor\" href=\"https://jono.nz/2020/08/23/waka-commuter/#maps\">#</a></h3>\n<p><a href=\"https://waka.app\">Waka</a> currently uses <a href=\"https://leafletjs.com/\">Leaflet</a>, but I decided to use <a href=\"https://github.com/mapbox/mapbox-gl-js\">mapbox-gl-js</a> for this project. I'm happy I did though, as vector maps provide a much better user experience—it not only loads faster, but you can zoom to any level, animate smoothly, rotate etc. I would love to find some time to move Waka over to vector maps in the future.</p>\n<p>It has a pretty nice styling system, that's almost like writing a stylesheet for geojson. You define what you want it to look like when the data meets certain conditions, and it more or less just works.</p>\n<p>The only other thing to note is that I optimized the <a href=\"https://datafinder.stats.govt.nz/layer/98970-statistical-area-2-2019-generalised/\">SA2 boundries</a>, as they are all loaded when the user loads the app. I ran the dataset through <a href=\"https://mapshaper.org/\">mapshaper.org</a>, and it simplified the geometry somewhat. I also ripped out the unnecessary metadata, cut the filesize from 21MB to 945KB gzipped as a result.</p>\n<h3 id=\"visualizations\" tabindex=\"-1\">Visualizations <a class=\"header-anchor\" href=\"https://jono.nz/2020/08/23/waka-commuter/#visualizations\">#</a></h3>\n<p>I spent a few hours experimenting with other libraries, but at the end of the day, the only viable option was <a href=\"https://d3js.org/\">D3.js</a>. I really struggled through this, spending a lot more time on building the simple bubble &amp; bar chart than I should have. As a result, the charts are much less interactive than I would like—you can hover &amp; click on them, but not much more.</p>\n<p>I wrapped all my mess up in some Web Components (via lit-element), which really simplified things. I bound plenty of event handlers on the map as well as other buttons in the UI, and then just had to update attributes on the components to get everything to update nicely. In a way, it kind of works like a jQuery app from 10 years ago.</p>\n<p>That's kinda it! Not much to it—more time was spent on the thinking &amp; design than the coding itself. That's the way it should be though—start with your customer outcomes, and the tech just becomes a means to create a solution.</p>\n<h2 id=\"feedback\" tabindex=\"-1\">Feedback <a class=\"header-anchor\" href=\"https://jono.nz/2020/08/23/waka-commuter/#feedback\">#</a></h2>\n<p>Have you used Waka Commuter? Give it a try, and I would love to hear what you think—reach out to me on Twitter <a href=\"https://twitter.com/consindo\">@consindo</a> for any feedback. As it's open source, also feel free to play around with the code, or even raise a pull request.</p>\n<p><a href=\"https://commuter.waka.app\">commuter.waka.app</a></p>\n",
			"date_published": "2020-08-23T11:45:00Z"
		}
		,
		{
			"id": "https://jono.nz/2020/06/21/card-guide-2020/",
			"url": "https://jono.nz/2020/06/21/card-guide-2020/",
			"title": "The best NZ debit &amp; credit cards of 2020",
			"content_html": "<p>There's a large number of debit &amp; credit card options in NZ, so it can be a little daunting when picking one out. That said, there isn't nearly as much competition as the USA or Australia, so it's actually possible to decide the definitive best cards.</p>\n<p>A huge amount of research went into the post—we hope it saves you some time and money.</p>\n<p>If you have any questions at all, tweet myself <a href=\"https://twitter.com/consindo\">@consindo</a> or <a href=\"https://twitter.com/multithreddy/\">@multithreddy</a>, who was a huge help writing this guide.</p>\n<h3 id=\"before-we-start\" tabindex=\"-1\">Before we start <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#before-we-start\">#</a></h3>\n<p>While you can save some money with credit cards, there are definitely better ways to save money. These include (but are not limited to) the following:</p>\n<ul>\n<li>Buying fewer things</li>\n<li>Finding a cheaper price (visiting a different store, or find a better utility provider)</li>\n<li>Not paying credit card surcharges (many utility providers will offer a 2-3% discount for direct debit payments)</li>\n</ul>\n<p>This guide assumes you pay off your full balance each month. Make sure you do this, otherwise you'll incur interest.</p>\n<p>It's also worth nothing that the &quot;break even&quot; calculations assume that you value 1 Airpoints Dollar = 1 NZD. If someone offered to trade you $100 cash for 100 Airpoints, you probably wouldn't do it.</p>\n<hr>\n<ul>\n<li><a href=\"https://jono.nz/2020/06/21/card-guide-2020/#The-best-debit-card\">The best debit card</a></li>\n<li><a href=\"https://jono.nz/2020/06/21/card-guide-2020/#The-best-FX-travel-card\">The best FX/travel card</a></li>\n<li><a href=\"https://jono.nz/2020/06/21/card-guide-2020/#The-best-free-credit-card\">The best free credit card</a></li>\n<li><a href=\"https://jono.nz/2020/06/21/card-guide-2020/#The-best-credit-card-for-groceries\">The best credit card for groceries</a></li>\n<li><a href=\"https://jono.nz/2020/06/21/card-guide-2020/#The-best-credit-card-for-cashback\">The best credit card for cashback</a></li>\n<li><a href=\"https://jono.nz/2020/06/21/card-guide-2020/#The-best-credit-card-for-airpoints\">The best credit card for airpoints</a></li>\n<li><a href=\"https://jono.nz/2020/06/21/card-guide-2020/#Notable-mentions\">Notable mentions</a></li>\n</ul>\n<h2 id=\"the-best-debit-card\" tabindex=\"-1\">The best debit card <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#the-best-debit-card\">#</a></h2>\n<p><em>Westpac Airpoints Debit Mastercard</em></p>\n<p>While you'll never need to carry cash in Aotearoa, you will need a debit card. Many merchants will not accept credit cards, due to the high interchange fees (<a href=\"https://www.westpac.co.nz/business/business-resource-centre/resources/fees/domestic-interchange/\">around 1.6% for credit</a>). Due to COVID-19, there's recently been an increase in acceptance as banks have waived contactless debit fees, but it's unlikely to last—you'll still need a debit card for now.</p>\n<p>The <a href=\"https://www.westpac.co.nz/bank-accounts/debit-cards/airpoints/\">Westpac Airpoints Debit Mastercard</a> is the only debit card in NZ with rewards. While the fees are low, the rewards are also low, so you will still need to spend a reasonable amount to break even. I wouldn't open a Westpac account to get this card—you would probably be better off finding a fees free debit card, such as the <a href=\"https://www.bnz.co.nz/personal-banking/everyday-banking/everyday-cards\">BNZ Flexi Debit Visa</a>.</p>\n<p>That said, if you're a student, this card is free. You probably can't get a credit card either, so just get this.</p>\n<h3 id=\"westpac-airpoints-debit-mastercard\" tabindex=\"-1\">Westpac Airpoints Debit Mastercard <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#westpac-airpoints-debit-mastercard\">#</a></h3>\n<p><a href=\"https://www.westpac.co.nz/bank-accounts/debit-cards/airpoints/\">westpac.co.nz/bank-accounts/debit-cards/airpoints</a></p>\n<p><img src=\"https://jono.nz/images/credit-cards/westpac-airpoints-debit.png\" alt=\"Westpac Airpoints Debit Mastercard\"></p>\n<ul>\n<li><strong>Rewards:</strong> 1 Airpoints Dollar for every $250 spent.</li>\n<li><strong>Card Fee:</strong> $15 <small>p.a.</small> (break even after $3,750 spend)</li>\n<li><strong>Additional Features:</strong> Apple Pay</li>\n<li><strong>Also consider:</strong> <a href=\"https://www.bnz.co.nz/personal-banking/everyday-banking/everyday-cards\">BNZ Flexi Debit Visa</a></li>\n</ul>\n<h2 id=\"the-best-fx-travel-card\" tabindex=\"-1\">The best FX/travel card <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#the-best-fx-travel-card\">#</a></h2>\n<p><em>TransferWise Debit Mastercard</em></p>\n<p>The <a href=\"https://transferwise.com/invite/i/jonathanc1490\">TransferWise Debit Mastercard</a> is great everywhere except New Zealand. It doesn't have the EFTPOS application on the SIM, so it's subject to the higher Debit Mastercard fees (~1.2%), and won't be accepted anywhere where credit isn't.</p>\n<p>Despite this, it's great outside of the country and for online shopping &amp; subscriptions in foreign currencies. TransferWise has the best foreign exchange rates, no card fees, and also makes it really easy to receive foreign currency. I used this card exclusively in the USA &amp; Australia last year, and also continue to use it to pay for all of my USD online subscriptions.</p>\n<p>You will save money if you get this card.</p>\n<p>Another option is the <a href=\"https://www.airnzonesmart.co.nz/\">Air NZ OneSmart</a>. It rewards you with 1 Airpoints dollar for every $100 spent overseas, and $200 spent locally. However, the foreign currency rates are not as good as TransferWise, and it suffers from the same Debit Mastercard acceptance problems.</p>\n<h3 id=\"transferwise-debit-mastercard\" tabindex=\"-1\">TransferWise Debit Mastercard <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#transferwise-debit-mastercard\">#</a></h3>\n<p><a href=\"https://transferwise.com/invite/i/jonathanc1490\">transferwise.com</a></p>\n<p><img src=\"https://jono.nz/images/credit-cards/transferwise-mastercard.png\" alt=\"TransferWise Debit Mastercard\"></p>\n<ul>\n<li><strong>Rewards:</strong> None</li>\n<li><strong>Card Fee:</strong> $0 <small>p.a.</small></li>\n<li><strong>Additional Features:</strong> Free ATM withdrawals up to NZ$350/month, Google Pay.</li>\n<li><strong>Also consider:</strong> <a href=\"https://www.airnzonesmart.co.nz/\">Air NZ OneSmart</a></li>\n</ul>\n<h2 id=\"the-best-free-credit-card\" tabindex=\"-1\">The best free credit card <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#the-best-free-credit-card\">#</a></h2>\n<p><em>ASB Visa Light &amp; SBS Visa Credit Card</em></p>\n<p>For the best free card, we have two winners, depending on what you're looking for.</p>\n<p>The <a href=\"https://www.asb.co.nz/credit-cards/visa-light.html\">ASB Visa Light</a> is handy for larger purchases. It doesn't charge any interest for 6 months on purchases over $1000, so it can definitely cushion the blow for items such as appliances, jewelry, or electronics. It's also just Visa, so has wide acceptance—much more convenient than signing up to store finance, or even pay later companies such as Afterpay.</p>\n<p>The other free card to consider is the <a href=\"https://www.sbsbank.co.nz/credit-card\">SBS Visa Credit Card</a>. It has no card fees, but offers $1 cashback for every $150 spent (paid quarterly). It's better than a lot of credit cards that charge fees, including ASB who charge $40/year for the same reward rate.</p>\n<p>I would get the ASB Visa Light for the occasional large purchase, and also pick up the SBS Visa if you aren't going to get a more premium cashback or airpoints card.</p>\n<h3 id=\"asb-visa-light\" tabindex=\"-1\">ASB Visa Light <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#asb-visa-light\">#</a></h3>\n<p><a href=\"https://www.asb.co.nz/credit-cards/visa-light.html\">asb.co.nz/credit-cards/visa-light</a></p>\n<p><img src=\"https://jono.nz/images/credit-cards/asb-visa-light.png\" alt=\"ASB Visa Light\"></p>\n<ul>\n<li><strong>Rewards:</strong> None</li>\n<li><strong>Card Fee:</strong> $0 <small>p.a.</small></li>\n<li><strong>Additional Features:</strong> 0<small>% p.a.</small> on $1000+ purchases for 6 months (this is technically a floating rate, but hasn't changed in the last three years), 0<small>% p.a.</small> Balance Transfer for 6 months, Apple Pay &amp; Google Pay.</li>\n</ul>\n<h3 id=\"sbs-visa-credit-card\" tabindex=\"-1\">SBS Visa Credit Card <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#sbs-visa-credit-card\">#</a></h3>\n<p><a href=\"https://www.sbsbank.co.nz/credit-card\">sbsbank.co.nz/credit-card</a></p>\n<p><img src=\"https://jono.nz/images/credit-cards/sbs-visa.png\" alt=\"SBS Visa Credit Card\"></p>\n<ul>\n<li><strong>Rewards:</strong> $1 cashback for every $150 spent (paid quarterly)</li>\n<li><strong>Card Fee:</strong> $0 <small>p.a.</small></li>\n<li><strong>Additional Features:</strong> None</li>\n</ul>\n<h2 id=\"the-best-credit-card-for-groceries\" tabindex=\"-1\">The best credit card for groceries <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#the-best-credit-card-for-groceries\">#</a></h2>\n<p><em>American Express Platinum Edge</em></p>\n<p>American Express isn't widely accepted in NZ (and their contactless standard, ExpressPay even less so). However, the cards are accepted at most large retailers including all major supermarkets and gas stations—luckily, they have a card just for this.</p>\n<p><a href=\"https://www.americanexpress.com/nz/credit-cards/platinum-edge-credit-card/\">The American Express Platinum Edge</a> earns you membership rewards, which you can exchange for airpoints, cashback, and many other things. The reward rate for groceries is particularly good—you receive the equivalent of 1 airpoints dollar for every $50 you spend at supermarkets. Airpoints isn't the only loyalty program though: you can exchange membership rewards for <a href=\"https://www.americanexpress.com/en-nz/rewards/membership-rewards/travel/all\">other airlines</a> at a rate of 1.5 miles/points for every dollar you spend on groceries. Exchanging points for cashback greatly depends on how much you are exchanging at one time. You can also maximize your rewards by purchasing gift cards at supermarkets, and then using them at other stores—good for more expensive items.</p>\n<p>While the card fee of $149 <small>p.a.</small> is relatively high, you receive a complimentary direct domestic return flight (with bags!) each year. It basically pays for itself, so you may as well get it and take the high reward rate for certain purchases as a bonus.</p>\n<p>There's also the occasional Amex offer, domestic travel insurance (rare in NZ), and as it's a global card, you'll be able to get Bank Feeds in software such as <a href=\"https://youneedabudget.com\">YNAB</a>.</p>\n<p>American Express also offer a <a href=\"https://www.americanexpress.com/nz/credit-cards/airnz-base-credit-card/\">free airpoints card</a> that rewards you with 1 airpoints dollar for every $100 spent on any purchase. Even though it's better than the Platinum Edge for everything that isn't groceries or fuel, you should just use a regular credit card for those purchases.</p>\n<h3 id=\"american-express-platinum-edge\" tabindex=\"-1\">American Express Platinum Edge <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#american-express-platinum-edge\">#</a></h3>\n<p><a href=\"https://www.americanexpress.com/nz/credit-cards/platinum-edge-credit-card/\">americanexpress.com/nz/credit-cards/platinum-edge-credit-card</a></p>\n<p><img src=\"https://jono.nz/images/credit-cards/amex-platinum-edge.png\" alt=\"American Express Platinum Edge\"></p>\n<ul>\n<li><strong>Rewards:</strong> 1 airpoints dollar for every $50 spent on groceries, $75 spent on petrol, and $150 on other purchases.</li>\n<li><strong>Card Fee:</strong> $149 <small>p.a.</small> (break even after $7,450 spend on groceries)</li>\n<li><strong>Additional Features:</strong> Free domestic return flight each year, complimentary domestic &amp; international travel insurance (35 days), Amex offers.</li>\n<li><strong>Also consider</strong>: <a href=\"https://www.americanexpress.com/nz/credit-cards/airnz-base-credit-card/\">American Express Airpoints</a></li>\n</ul>\n<h2 id=\"the-best-credit-card-for-cashback\" tabindex=\"-1\">The best credit card for cashback <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#the-best-credit-card-for-cashback\">#</a></h2>\n<p><em>BNZ Advantage Visa Platinum</em></p>\n<p>If you're after cashback, the <a href=\"https://www.bnz.co.nz/personal-banking/credit-cards/bnz-advantage\">BNZ Advantage Platinum</a> is for you. It has a reasonable cashback rate (paid monthly), and doesn't require you to spend a minimum amount each year. It also has a number of extra goodies, including price protection—a benefit that is very rare in NZ.</p>\n<p>Choose whether you want this airpoints or cashback, and then use this card for most of your spending (except foreign currency &amp; groceries).</p>\n<p>The other cashback card to consider is the <a href=\"https://www.sbsbank.co.nz/credit-card\">SBS Visa Credit Card</a>—detailed above in <a href=\"https://jono.nz/2020/06/21/card-guide-2020/#The-best-free-credit-card\">the best free credit card</a> section.</p>\n<h3 id=\"bnz-advantage-visa-platinum\" tabindex=\"-1\">BNZ Advantage Visa Platinum <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#bnz-advantage-visa-platinum\">#</a></h3>\n<p><a href=\"https://www.bnz.co.nz/personal-banking/credit-cards/bnz-advantage\">bnz.co.nz/personal-banking/credit-cards/bnz-advantage</a></p>\n<p><img src=\"https://jono.nz/images/credit-cards/bnz-advantage-platinum.png\" alt=\"BNZ Advantage Visa Platinum\"></p>\n<ul>\n<li><strong>Rewards:</strong> $1 cashback for every $90 spent (paid monthly)</li>\n<li><strong>Card Fee:</strong> $90 <small>p.a.</small> (break even after $8,100 spend)</li>\n<li><strong>Additional Features:</strong> International travel insurance (90 days), purchase protection, price protection, Apple Pay &amp; Google Pay.</li>\n<li><strong>Also consider:</strong> <a href=\"https://www.sbsbank.co.nz/credit-card\">SBS Visa Credit Card</a></li>\n</ul>\n<h2 id=\"the-best-credit-card-for-airpoints\" tabindex=\"-1\">The best credit card for airpoints <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#the-best-credit-card-for-airpoints\">#</a></h2>\n<p><em>Westpac Airpoints Platinum Mastercard</em></p>\n<p>All of the Airpoints Platinum cards in New Zealand aren't particularly different—they all have similar reward rates, travel insurance, fees etc.</p>\n<p>While the <a href=\"https://www.westpac.co.nz/credit-cards/airpoints/airpoints-platinum-mastercard/\">Westpac Airpoints Platinum Mastercard</a> earns status points at a slightly reduced rate to the <a href=\"https://www.kiwibank.co.nz/personal-banking/credit-cards/airpoints-credit-cards/platinum-visa/\">Kiwibank Airpoints Platinum</a> (they offer 1 Status Point for $200 spend), the Westpac card includes 12 months extended warranty and 90 day purchase protection. I think most people will find the extra insurance more compelling.</p>\n<p>Choose whether you want this airpoints or cashback, and then use this card for most of your spending (except foreign currency &amp; groceries).</p>\n<h3 id=\"westpac-airpoints-platinum-mastercard\" tabindex=\"-1\">Westpac Airpoints Platinum Mastercard <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#westpac-airpoints-platinum-mastercard\">#</a></h3>\n<p><a href=\"https://www.westpac.co.nz/credit-cards/airpoints/airpoints-platinum-mastercard/\">westpac.co.nz/credit-cards/airpoints/airpoints-platinum-mastercard</a></p>\n<p><img src=\"https://jono.nz/images/credit-cards/westpac-airpoints-platinum.png\" alt=\"Westpac Airpoints Platinum Mastercard\"></p>\n<ul>\n<li><strong>Rewards:</strong> 1 airpoints dollar for every $75 spent. 1 Status Point for every $225 spent.</li>\n<li><strong>Card Fee:</strong> $150 p.a. (break even after $11,250 spend)</li>\n<li><strong>Additional Features:</strong> Complimentary international travel insurance, 12 months extended warranty, 90 days purchase protection, Apple Pay.</li>\n<li><strong>Also consider:</strong> <a href=\"https://www.kiwibank.co.nz/personal-banking/credit-cards/airpoints-credit-cards/platinum-visa/\">Kiwibank Airpoints Platinum Visa</a></li>\n</ul>\n<h2 id=\"notable-mentions\" tabindex=\"-1\">Notable mentions <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#notable-mentions\">#</a></h2>\n<h3 id=\"flight-centre-mastercard\" tabindex=\"-1\">Flight Centre Mastercard <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#flight-centre-mastercard\">#</a></h3>\n<p><a href=\"https://www.flightcentremastercard.co.nz/\">flightcentremastercard.co.nz</a></p>\n<p>The Flight Centre Mastercard is the only credit card in NZ without international transaction fees. It's kinda weird really, given that it's a store card. You also get $1 in Flight Centre credit for every $100 you spend and they also support Apple Pay &amp; Google Pay (I'm looking at you, Kiwibank!)</p>\n<h3 id=\"westpac-world-airpoints\" tabindex=\"-1\">Westpac World Airpoints <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#westpac-world-airpoints\">#</a></h3>\n<p><a href=\"https://www.westpac.co.nz/credit-cards/airpoints/airpoints-world-mastercard/\">westpac.co.nz/credit-cards/airpoints/airpoints-world-mastercard</a></p>\n<p>The Westpac World Airpoints is the only premium credit card in NZ. It has a great airpoints earn rate, as well as other benefits including concierge and lounge access. With a card fee of $390 per year, it probably works out if you spend a lot of money (the card fee is halved), or travel frequently internationally.</p>\n<p>The <a href=\"https://www.westpac.co.nz/credit-cards/hotpoints/hotpoints-world-mastercard/\">Westpac hotpoints World</a> card also exists with largely the same benefits, and it's technically the highest (non Amex) cashback card in NZ (~1.4%).</p>\n<h3 id=\"american-express-platinum\" tabindex=\"-1\">American Express Platinum <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#american-express-platinum\">#</a></h3>\n<p><a href=\"https://www.americanexpress.com/nz/credit-cards/platinum-card/\">americanexpress.com/nz/credit-cards/platinum-card</a></p>\n<p>The American Express Platinum is a charge card with a fee of $1,250 a year. It's a game of balancing the benefits with the annual card fee. If you travel internationally frequently, it may work out for you, but you probably won't be traveling internationally much for a while.</p>\n<h3 id=\"kiwibank-platinum-visa\" tabindex=\"-1\">Kiwibank Platinum Visa <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/21/card-guide-2020/#kiwibank-platinum-visa\">#</a></h3>\n<p><a href=\"https://www.kiwibank.co.nz/personal-banking/credit-cards/low-interest-cards/platinum-visa/\">kiwibank.co.nz/personal-banking/credit-cards/low-interest-cards/platinum-visa</a></p>\n<p>The Kiwibank Platinum Visa offers no rewards or cashback. It costs $80 per year.</p>\n<p>I have no idea why you would get this.</p>\n<hr>\n<p>Phew. We got there. I hope you found this helpful! A huge amount of research went into this post—thanks to <a href=\"https://twitter.com/multithreddy/\">@multithreddy</a> again for helping me out.</p>\n<p>If you have any questions or comments at all (about any NZ card honestly), tweet us <a href=\"https://twitter.com/consindo/\">@consindo</a> &amp; <a href=\"https://twitter.com/multithreddy/\">@multithreddy</a>.</p>\n<style>\n  .post img {\n    max-width: 240px;\n    border: 0;\n    margin: 0;\n  }\n</style>\n",
			"date_published": "2020-06-21T10:30:00Z"
		}
		,
		{
			"id": "https://jono.nz/2020/06/15/kiwibuild/",
			"url": "https://jono.nz/2020/06/15/kiwibuild/",
			"title": "I bought some things",
			"content_html": "<p>Everyone kept saying <a href=\"https://www.kiwibuild.govt.nz/\">KiwiBuild</a> was a <a href=\"https://twitter.com/NZNationalParty/status/1208635781516025858\">failure</a>, so I decided to try it myself. I also bought a bunch of other things—here's my attempt at reviewing them.</p>\n<h2 id=\"kiwibuild-the-scheme\" tabindex=\"-1\">KiwiBuild (the scheme) <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#kiwibuild-the-scheme\">#</a></h2>\n<p>It was fine, I guess? Apart from signing a covenant saying I can't sell or rent the place for a year, there wasn't much to it. I don't think there was a discount either—half the units in the building were on the open market, and the prices look mostly the same. That said, without KiwiBuild, the apartment block may not have been built.</p>\n<p>I was also able to withdraw my <a href=\"https://kaingaora.govt.nz/home-ownership/kiwisaver-first-home-withdrawal/\">KiwiSaver</a>, and get a <a href=\"https://kaingaora.govt.nz/home-ownership/first-home-grant/\">First Home Grant</a>. Without these schemes, I wouldn't have been able to get a deposit together.</p>\n<p>A year elapsed between purchasing the unit off the plans and moving in. The build was mostly on-time, but ended up being delayed a few months due to <a href=\"https://shorthand.radionz.co.nz/coronavirus-timeline/index.html\">New Zealand's lockdown</a> to prevent the spread of COVID-19.</p>\n<h2 id=\"kiwibuild-the-house-itself\" tabindex=\"-1\">KiwiBuild (the house itself) <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#kiwibuild-the-house-itself\">#</a></h2>\n<p>I'm really happy with the place! It's just really nice living in a new apartment and having modern amenities such as air conditioning, insulation, and double glazing (man, I wish this was more common in NZ). The neighborhood is also pretty good—while it's not in the CBD, it's only a five minute walk to the train+bus interchange and other shops. As a result, the apartment doesn't come with car parking (although it does come with bike parking &amp; lockers), which ends up reducing the total cost of the place.</p>\n<p><img src=\"https://jono.nz/images/house.jpg\" alt=\"Fisher &amp; Paykel Kitchen\"></p>\n<p>The apartment itself is pretty spacious for a one bedroom (54m<sup>2</sup>) and is reasonably well designed. There's large windows which get lots of light and it has a sun room, which is way more practical than a balcony. If I had to nitpick, the kitchen has some weird design (the microwave space isn't big enough for a microwave) and the shower pressure could be better (this is actually to save water—<a href=\"https://aucklandwatersupply.co.nz/\">Auckland is in a drought</a>).</p>\n<p>Overall, it's really good. I would highly recommend a KiwiBuild home.</p>\n<h2 id=\"banks\" tabindex=\"-1\">Banks <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#banks\">#</a></h2>\n<p>Avoid, if possible. I wasn't expecting much, but there was a whole lot of drama getting a mortgage, delaying settlement by two days. Lots of stupid stuff, like not accepting digital signatures, requiring a higher deposit than agreed upon, and needing to run into a physical branch multiple times. At least I ended getting a mortgage, and a pretty good interest rate.</p>\n<p>I ended up going with <a href=\"https://westpac.co.nz\">Westpac</a>, but I think they're all pretty bad.</p>\n<h2 id=\"fisher-and-paykel-appliances\" tabindex=\"-1\">Fisher &amp; Paykel Appliances <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#fisher-and-paykel-appliances\">#</a></h2>\n<p><img src=\"https://jono.nz/images/fisher-paykel.jpg\" alt=\"Fisher &amp; Paykel Kitchen\"></p>\n<p>The apartment came with the usual (oven, rangehood, stove, dishdrawer), and I got a matching <a href=\"https://www.fisherpaykel.com/nz/kitchen/fridges-freezers/fridges/activesmartfridge-635mm-bottom-freezer-403l-5.RF402BRGX6.html\">fridge</a> &amp; <a href=\"https://www.fisherpaykel.com/nz/laundry/washing-machines/front-loaders/fabricsmart-8-0kg.WH8060F1.html\">washing machine</a>. They seem to do what they're supposed to, look nice, and weren't expensive. Unfortunately, the apartment didn't allow any customization, but I'll probably upgrade to a Fisher &amp; Paykel induction stove in the future.</p>\n<h2 id=\"ikea-friheten\" tabindex=\"-1\">IKEA FRIHETEN <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#ikea-friheten\">#</a></h2>\n<p>We don't have IKEA in NZ yet, but this sofa was too good to pass up. It unfolds into a sofa bed, but in a unique way—the seat slides out, and the back folds down. As a result, it's much more comfortable than most sofa beds. There's also plenty of storage in the base.</p>\n<p><img src=\"https://jono.nz/images/ikea-friheten.jpg\" alt=\"IKEA FRIHETEN\"></p>\n<p>The only downside is that it weighs 115kg! I purchased it from <a href=\"https://www.urbansales.co.nz/ikea-friheten-three-seat-sofa-bed-skiftebo-dark-grey\">Urban Sales</a>, and it arrived in about six weeks (even with the lockdown).</p>\n<h2 id=\"napp-mattress\" tabindex=\"-1\">Napp Mattress <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#napp-mattress\">#</a></h2>\n<p><a href=\"https://napp.co.nz/\">Napp</a> is a mattresses-in-a-box, and it's definitely one of the nicer mattresses I've slept on. It's on the firmer side, but I've been sleeping well over the past few days. They're made in New Zealand but the foam is from Australia, so shipping delays meant I was sleeping on an air bed for a few weeks.</p>\n<p>It also didn't come in a box—it just came rolled up in the back seat of some dude's Ford Falcon.</p>\n<h2 id=\"target-furniture\" tabindex=\"-1\">Target Furniture <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#target-furniture\">#</a></h2>\n<p><img src=\"https://jono.nz/images/target-furniture.jpg\" alt=\"Target Furniture Showroom\"></p>\n<p>I bought a <a href=\"https://www.targetfurniture.co.nz/veno-1500-extension-table\">table</a> &amp; <a href=\"https://www.targetfurniture.co.nz/dining/furniture/chairs/liva-dining-chair-dark-grey\">chairs</a> from Target, and I'll definitely be going back to get more furniture. They have nice things, are reasonably cheap, and their showroom contains most of what they sell online. I went to their store in Botany and was able to pick up the table the same day, but had to wait a week for the chairs to arrive from Wellington.</p>\n<h2 id=\"ikea-nisse\" tabindex=\"-1\">IKEA Nisse <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#ikea-nisse\">#</a></h2>\n<p>As my chairs took a week to arrive, I bought some folding chairs from <a href=\"https://www.urbansales.co.nz/ikea-nisse-folding-chair-black\">Urban Sales</a>. They look nice enough, and are surprisingly comfortable—I was pretty happy working from home on them.</p>\n<h2 id=\"nvidia-shield-tv\" tabindex=\"-1\">NVIDIA Shield TV <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#nvidia-shield-tv\">#</a></h2>\n<p>It's expensive, but worth it. The hardware is very nice—the device itself just hides away (like a Chromecast), and the remote has just the right amount of buttons. Except maybe, the giant Netflix button. It also has an IR blaster, so I don't have to use the gross remote supplied with my TV.</p>\n<p>Android TV is pretty simple, but it has apps for all the streaming services I use (except Apple TV+). The AI Upscaling in the Shield works surprisingly well, especially with <a href=\"https://www.matthuisman.nz/2018/12/how-to-live-nz-iptv-channels-on-android.html\">NZ's 720p IPTV streams</a>. I also have an NVIDIA graphics card, and GameStream seems to work well (both through the official app, and <a href=\"https://moonlight-stream.org/\">Moonlight</a>).</p>\n<p>That said, it's almost the same price as an Xbox. If you don't already have a gaming PC, I would probably just get an Xbox.</p>\n<h2 id=\"2degrees-broadband\" tabindex=\"-1\">2degrees Broadband <a class=\"header-anchor\" href=\"https://jono.nz/2020/06/15/kiwibuild/#2degrees-broadband\">#</a></h2>\n<p>The speeds ain't bad, but I'm still looking forward to <a href=\"https://hyperfibre.chorus.co.nz/\">Hyperfibre</a>.</p>\n<img class=\"speedtest\" alt=\"2ms ping, 915.49mbps down, 392.66mbps up\" src=\"https://www.speedtest.net/result/9602841682.png\">\n<style>\n  img.speedtest {\n    width: 350px !important;\n    height: 200px !important;\n  }\n</style>\n<hr>\n<p>Hope you enjoyed this little review of things! I'm still in the process of getting new things, so I might review those in a future post.</p>\n",
			"date_published": "2020-06-15T08:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2020/05/03/mapcreator/",
			"url": "https://jono.nz/2020/05/03/mapcreator/",
			"title": "Map Creator",
			"content_html": "<p>I've always liked transit maps. They not only help us get from A to B, but can also tell a story about a city. Well designed transit maps not only serve a utility, but are also public art.</p>\n<p>There's lots of different types of transit maps, but the most common is the <a href=\"https://tfl.gov.uk/maps/track/tube\">London Underground schematic style</a>. I've wanted to design one of these for myself, but I've never had the patience to make one using Illustrator or Figma. I don't think these tools are particularly suited towards transit maps. We should be able to define a map the same way the routes are defined—it should be as simple as specifying the nodes and connections.</p>\n<p>We're currently in lockdown here in New Zealand, so it does feel a bit silly to work on <a href=\"https://waka.app\">Waka</a> at the moment. Instead, I spent the last couple of weeks building a tool to help make drawing transit maps easier. The first step was the most basic scenario—a single line, with a bend in it.</p>\n<p><img src=\"https://jono.nz/images/mapcreator/1-line.svg\" alt=\"One transit line with two stations and a bend\"></p>\n<p>Simple enough. Just draw a line, and use a bit of trigonometry to figure out the coordinates for the angles. Cool. Now, what happens when we add a second line?</p>\n<p><img src=\"https://jono.nz/images/mapcreator/2-lines-no-fixes.svg\" alt=\"Two transit line with two stations and a bend\"></p>\n<p>It turns out, the lines overlap. This is because the lines have a width, so you need to account for that when you bend lines. I've made the diagram above a little bit transparent, so it's easier to see this issue. Again, with a little bit of trigonometry, I was able to fix this all up.</p>\n<p>The lines of transit maps often swap over when the angles of the line change, so this was the next thing I accounted for. It's a little bit difficult, as you also have to account for the change in length of line. Nevertheless, after a bit of hair pulling, I got the result I was after:</p>\n<p><img src=\"https://jono.nz/images/mapcreator/2-lines-swap.svg\" alt=\"Two transit line with two stations, a bend, and a stacking swap\"></p>\n<p>Things get more and more complicated the moment you introduce 3, 4, 5+ lines. Modifying an equation to fix one case, will often break another. To keep track of all these different scenarios, I used <a href=\"https://storybook.js.org/\">Storybook</a> and wrapped everything up as a <a href=\"https://developer.mozilla.org/en-US/docs/Web/Web_Components\">web component</a>.</p>\n<p>As the application essentially runs a <a href=\"https://en.wikipedia.org/wiki/Breadth-first_search\">Breadth-first search</a> and outputs a SVG, I decided against using a framework like React, Vue, or Angular for now. Web components were the perfect lightweight solution I needed.</p>\n<p><img src=\"https://jono.nz/images/mapcreator/storybook.png\" alt=\"Storybook with all the different test cases\"></p>\n<p>By regression testing any small tweak to my code, I was able to come up with a general solution for any angle, any number of lines, and any change in stacking. As a bonus, I was able to delete lots of code once I arrived at my pair of equations!</p>\n<p><img src=\"https://jono.nz/images/mapcreator/4-line.svg\" alt=\"Complex 4 line example\"></p>\n<p>Currently, it won't stop you from making a bad looking map, but at least the angles will be correct! The other nice thing about getting all the math right is that you can easily change the look by modifying a few parameters.</p>\n<p><img src=\"https://jono.nz/images/mapcreator/4-line-smoothed.svg\" alt=\"Complex 4 line example with different styles\"></p>\n<p>I'm not totally sure where I'm going to take it next, but there's a lot of room for improvement. I might try replicating a couple of real-life maps, and seeing how far I get. At the very least, I'm going to have to add labels for stations!</p>\n",
			"date_published": "2020-05-03T10:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2020/02/02/dymajo-waka-guidebooks/",
			"url": "https://jono.nz/2020/02/02/dymajo-waka-guidebooks/",
			"title": "Waka Local Guidebooks",
			"content_html": "<p>There's a lot more to a transport network than maps and timetables. Each city has its own quirks, and you'll often only discover these by experiencing them for yourself. Even the smallest things such as paying a fare can be confusing if you've never done it before.</p>\n<p>That's why we're introducing local guidebooks in Waka. These are local guides to help you understand your city's transport and get around more effectively. They're designed to be super handy if you've never used the network before, but you might still learn a thing or two if you're a long-time user! They're also a quick &amp; easy reference to things like zones &amp; fares. Additionally, these guides are open source and <em>editable by anyone!</em></p>\n<p><img src=\"https://jono.nz/images/waka-guides.jpg\" alt=\"Waka Guidebooks\"></p>\n<p><em>Te Whanganui-a-Tara, Wellington</em> is our first city with a guidebook. We've currently just got the basics in there - some fare information, and how to get to the airport. We would love to <a href=\"https://waka.app/feedback\">get your feedback</a> to see what you think and decide whether we should roll out these guides to more cities!</p>\n<p><a href=\"https://waka.app/guide/nz-wlg\">https://waka.app/guide/nz-wlg</a></p>\n<p>For code changes, please see the GitHub releases:</p>\n<ul>\n<li><a href=\"https://github.com/dymajo/waka/releases/tag/v2.4.5\">Waka Release</a></li>\n<li><a href=\"https://github.com/dymajo/waka-guidebooks\">Waka Guidebooks</a></li>\n</ul>\n",
			"date_published": "2020-02-02T12:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2020/01/23/every-lot-bot/",
			"url": "https://jono.nz/2020/01/23/every-lot-bot/",
			"title": "Every Lot Bot",
			"content_html": "<p><strong>Update: These accounts are no longer online as Twitter no longer allows automated bots. Additionally, the Tokyo account is no longer available.</strong></p>\n<p>Over the long weekend, <a href=\"https://twitter.com/nzsd\">@nzsd</a> &amp; I set up a bunch of bots that tweet a street view photo of every lot for a bunch of cities. They tweet every 20-30 minutes, and you can follow them here:</p>\n<ul>\n<li>Auckalnd: <a href=\"https://twitter.com/everylotakl\">@everylotakl</a></li>\n<li>Christchurch: <a href=\"https://twitter.com/everylotchc\">@everylotchc</a></li>\n<li>Tokyo: <a href=\"https://twitter.com/everylottokyo\">@everylottokyo</a></li>\n<li>Wellington: <a href=\"https://twitter.com/everylotwlg\">@everylotwlg</a></li>\n</ul>\n<p>They've already tweeted some fun stuff:</p>\n<jc-center>\n  <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1A Waitomo Avenue, Mount Eden <a href=\"https://t.co/SN2Of4yKna\">pic.twitter.com/SN2Of4yKna</a></p>&mdash; every lot auckland (@everylotakl) <a href=\"https://twitter.com/everylotakl/status/1219479779746824193?ref_src=twsrc%5Etfw\">January 21, 2020</a></blockquote>\n</jc-center>\n<jc-center>\n  <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2B Mount Street, Te Aro <a href=\"https://t.co/4Yc1jiLRy6\">pic.twitter.com/4Yc1jiLRy6</a></p>&mdash; every lot wellington (@everylotwlg) <a href=\"https://twitter.com/everylotwlg/status/1219130230993911808?ref_src=twsrc%5Etfw\">January 20, 2020</a></blockquote>\n</jc-center>\n<jc-center>\n  <blockquote class=\"twitter-tweet\"><p lang=\"zh\" dir=\"ltr\">中央区八重洲一丁目 6-14 <a href=\"https://t.co/8kEoJ85b6Z\">pic.twitter.com/8kEoJ85b6Z</a></p>&mdash; every lot tokyo / 東京のすべての土地 (@everylottokyo) <a href=\"https://twitter.com/everylottokyo/status/1218835538540498944?ref_src=twsrc%5Etfw\">January 19, 2020</a></blockquote>\n</jc-center>\n<p>However, the main thing I've noticed so far is just how ugly the average New Zealand house is. We're now living in an age where we're going to demolish a lot of them, but honestly, it's for the best.</p>\n<jc-center>\n  <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">162 Grahams Road, Burnside <a href=\"https://t.co/pvC5xAKRpT\">pic.twitter.com/pvC5xAKRpT</a></p>&mdash; every lot christchurch (@everylotchc) <a href=\"https://twitter.com/everylotchc/status/1220232739774844928?ref_src=twsrc%5Etfw\">January 23, 2020</a></blockquote>\n</jc-center>\n<p>The bots use the <a href=\"https://github.com/fitnr/everylotbot\">same open source code</a> as some of the <a href=\"https://twitter.com/fitnr/lists/every-lot\">other every lot bots</a> around the world. However, ours runs as CronJob on Kubernetes (it's using the same cluster that Waka uses!). I can't speak too much creating the GIS database, but you can deploy your own bot with the Terraform here: <a href=\"https://github.com/consindo/everylotbot-k8s\">https://github.com/consindo/everylotbot-k8s</a>.</p>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n",
			"date_published": "2020-01-23T10:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2020/01/08/dymajo-leave-waka-feedback/",
			"url": "https://jono.nz/2020/01/08/dymajo-leave-waka-feedback/",
			"title": "Leave Feedback in Waka",
			"content_html": "<p>You can now send us feedback inside Waka! You can get there from the home page, or by heading to <a href=\"https://waka.app/feedback\">waka.app/feedback</a>. You'll also be able offered to provide feedback if Waka crashes in any way. We really value your feedback, so we would love to hear what you think.</p>\n<p><img src=\"https://jono.nz/images/waka-galaxy-fold.jpg\" alt=\"Waka on Samsung Galaxy Fold\"></p>\n<p>There's also been a few changes behind the scenes. We've made a few minor layout improvements to support devices that are larger than phones, but smaller than tablets - the Galaxy Fold is one example. We've also moved our infrastructure off Amazon ECS, and onto <a href=\"https://kubernetes.io\">Kubernetes</a> on Digital Ocean. It makes our lives easier, but hopefully you don't notice a difference!</p>\n<p>For code changes, please see the GitHub releases:</p>\n<ul>\n<li><a href=\"https://github.com/dymajo/waka/releases/tag/v2.4.4\">Waka Release</a></li>\n<li><a href=\"https://github.com/dymajo/waka-server/releases/tag/v2.4.2\">Waka Server Release</a></li>\n<li><a href=\"https://github.com/dymajo/waka-importer/releases/tag/v2.4.3\">Waka Importer Release</a></li>\n</ul>\n",
			"date_published": "2020-01-08T12:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2019/12/16/kubernetes-forum-sydney-2019/",
			"url": "https://jono.nz/2019/12/16/kubernetes-forum-sydney-2019/",
			"title": "Kubernetes Forum Sydney",
			"content_html": "<p>I recently had the privilege to speak about Xero's Kubernetes platform at <a href=\"https://events.linuxfoundation.org/events/kubernetes-forum-sydney-2019/\">Kubernetes Forum Sydney 2019</a>. I focused on how we adopted the mindset of a platform as a product, in order to empower our development teams.</p>\n<p><img src=\"https://jono.nz/images/jono-speaking-k8s-forum.jpg\" alt=\"Jono presenting the keynote at Kubernetes Forum Sydney 2019\"></p>\n<p>I think it went really well, and received a lot of great feedback afterwards! A recording is now available online for those who missed it.</p>\n<link rel=\"stylesheet\" href=\"https://jono.nz/embed/lite-yt-embed.css\">\n<script src=\"https://jono.nz/embed/lite-yt-embed.js\"></script>\n<p><lite-youtube videoid=\"k3CLW8siogE\"></lite-youtube></p>\n<p><a href=\"https://www.youtube.com/watch?v=k3CLW8siogE\">https://www.youtube.com/watch?v=k3CLW8siogE</a></p>\n<p>The talk has also been adapted into a post, for the Humans of Xero Blog. <a href=\"https://medium.com/humans-of-xero/enabling-world-class-engineering-with-kubernetes-5ff514924ec8\">https://medium.com/humans-of-xero/enabling-world-class-engineering-with-kubernetes-5ff514924ec8</a></p>\n",
			"date_published": "2019-12-16T20:07:00Z"
		}
		,
		{
			"id": "https://jono.nz/2019/09/17/dymajo-hello-christchurch/",
			"url": "https://jono.nz/2019/09/17/dymajo-hello-christchurch/",
			"title": "Waka Christchurch",
			"content_html": "<p>We've brought Waka to Ōtautahi, Christchurch! You can now track your bus in realtime, and check if your service will be delayed. To get started, you can simply tap the &quot;locate me&quot; button on Waka's map (if you're in Christchurch!), or choose <a href=\"https://waka.app/region\">Switch City</a>.</p>\n<p><img src=\"https://jono.nz/images/waka-christchurch.jpg\" alt=\"Waka Route Map\"></p>\n<p>We hope Waka makes your Christchurch commute easier!</p>\n<p>For code changes, please see the GitHub releases:</p>\n<ul>\n<li><a href=\"https://github.com/dymajo/waka/releases/tag/v2.4.1\">Waka Release</a></li>\n<li><a href=\"https://github.com/dymajo/waka-server/releases/tag/v2.4.1\">Waka Server Release</a></li>\n<li><a href=\"https://github.com/dymajo/waka-importer/releases/tag/v2.4.1\">Waka Importer Release</a></li>\n</ul>\n",
			"date_published": "2019-09-17T09:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2019/09/04/dymajo-new-route-map/",
			"url": "https://jono.nz/2019/09/04/dymajo-new-route-map/",
			"title": "New Route Maps in Waka",
			"content_html": "<p>We've added a great new route map to Waka today. After choosing a line from the routes page, or a service from a station, you'll now have an overview of all the next departures.</p>\n<p>You're able to see long it takes to get to each station, and transfers you can make at each station. To view services in other directions, or with different stopping patterns, you can tap the route icon in the top corner.</p>\n<p><img src=\"https://jono.nz/images/waka-route-map.png\" alt=\"Waka Route Map\"></p>\n<p>We hope you love using the new route map!</p>\n<p>We also did a lot of housekeeping to prepare for adding more new cities. Please see the following GitHub releases for code changes:</p>\n<ul>\n<li><a href=\"https://github.com/dymajo/waka/releases/tag/2.4\">Waka Release</a></li>\n<li><a href=\"https://github.com/dymajo/waka-server/releases/tag/2.4\">Waka Server Release</a></li>\n<li><a href=\"https://github.com/dymajo/waka-importer/releases/tag/v2.4\">Waka Importer Release</a></li>\n</ul>\n",
			"date_published": "2019-09-04T12:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2019/07/15/devlog-2019-07/",
			"url": "https://jono.nz/2019/07/15/devlog-2019-07/",
			"title": "Dev Log: April - July 2019",
			"content_html": "<p>Yikes. Haven't done one of these in a while. It's mostly because I'm really busy at work - turns out, everyone wants to use Kubernetes. I also bought a house, which turns out to be quite a stressful process.</p>\n<h2 id=\"waka\" tabindex=\"-1\">Waka <a class=\"header-anchor\" href=\"https://jono.nz/2019/07/15/devlog-2019-07/#waka\">#</a></h2>\n<p>We've been reducing technical debt in Waka. The server has been entirely rewritten in TypeScript, we're adding tests, and making it really easy to add more cities. The app itself is also getting a little bit of love, and we're looking at improving the route page and adding service alerts in the near future. Just for fun, we also rewrote waka-proxy in golang.</p>\n<p>The architecture itself hasn't changed a lot since the last post, but we have added a new component. It's called waka-realtime, and it's responsible for pulling realtime information from agencies and putting them in a Redis cache. waka-worker now pulls from the Redis cache, as opposed to doing the pulls itself, and storing it in RAM.</p>\n<p>This new component allows us to make more of Waka &quot;serverless&quot;, and run on AWS Lambda. Even though we run our ECS cluster on spot instances, it's still expensive to maintain a seperate test environment.</p>\n<p>There's a lot more coming to Waka really soon, we're looking forward to announcing the availbility of our next two cities - Sydney &amp; Christchurch.</p>\n<h2 id=\"nitro\" tabindex=\"-1\">Nitro <a class=\"header-anchor\" href=\"https://jono.nz/2019/07/15/devlog-2019-07/#nitro\">#</a></h2>\n<p>Unfortunately, Nitro hasn't seen a lot of work on the last couple of months. I've mainly been fixing up UI bugs - the server is rock solid. Upon reflection, building a really fancy user interface isn't a good way to get a product out quickly. While it's a clean, simple experience, the animations and transitions have proved to be difficult to stabilize. I don't want to abandon things, and will look to getting a public beta out soon.</p>\n<p>In terms of infrastructure changes, I've moved the account manager (activates accounts and invitations) from ECS to Lambda.</p>\n<hr>\n<p>That's really it for the last couple of months. Fingers crossed that I'll have more to post about soon!</p>\n",
			"date_published": "2019-07-15T13:10:00Z"
		}
		,
		{
			"id": "https://jono.nz/2019/04/19/waka-cloud-native/",
			"url": "https://jono.nz/2019/04/19/waka-cloud-native/",
			"title": "A Cloud Native Waka",
			"content_html": "<p>Recently, Waka has a had a bit of a rewrite to make it much easier to get started locally, and is now able to be run in a high-availability, cloud native configuration.</p>\n<h2 id=\"old-waka\" tabindex=\"-1\">Old Waka <a class=\"header-anchor\" href=\"https://jono.nz/2019/04/19/waka-cloud-native/#old-waka\">#</a></h2>\n<p>Old Waka was a little bit of a monolith. Everything was bundled together into the <a href=\"https://github.com/dymajo/waka\">dymajo/waka</a> repository. The barrier to entry was high - you had to get everything going if you wanted to develop it.</p>\n<p>Everything also used a crazy, multi-process architecture /2017/10/08/transit-part1/. It provided a way to split cities processes from each other. This was helpful when the software was less stable - an import of a new Auckland timetable could crash Wellington. <strong>I would not recommend this</strong>. It's way more sensible to use a proper application orchestration technology, such as Amazon ECS or Kubernetes.</p>\n<h2 id=\"new-waka\" tabindex=\"-1\">New Waka <a class=\"header-anchor\" href=\"https://jono.nz/2019/04/19/waka-cloud-native/#new-waka\">#</a></h2>\n<p>New Waka addresses all these issues. The application has been split into a number of components, but still delivers an excellent development experience. It also <strong>doesn't require any set-up</strong> to get going.</p>\n<ul>\n<li><a href=\"https://github.com/dymajo/waka\">waka</a> - the front end</li>\n<li><a href=\"https://github.com/dymajo/waka-importer\">waka-importer</a> - task that downloads GTFS feeds, and imports them into SQL Server</li>\n<li><a href=\"https://github.com/dymajo/waka-server\">waka-orchestrator</a> - service that manages manages timetable updates</li>\n<li><a href=\"https://github.com/dymajo/waka-server\">waka-proxy</a> - service that discovers running workers, and redirects map requests</li>\n<li><a href=\"https://github.com/dymajo/waka-server\">waka-worker</a> - service that provides gtfs and realtime information for each city</li>\n<li><a href=\"https://github.com/dymajo/waka-healthcheck\">waka-healthcheck</a> - a lambda to <a href=\"https://assets-us-west-2.waka.app/status/index.html\">check if waka is up</a></li>\n<li><a href=\"https://github.com/dymajo/waka-maps\">waka-maps</a> - scripts that generate map tiles, and upload them to S3</li>\n</ul>\n<h2 id=\"how-was-it-done\" tabindex=\"-1\">How was it done? <a class=\"header-anchor\" href=\"https://jono.nz/2019/04/19/waka-cloud-native/#how-was-it-done\">#</a></h2>\n<h3 id=\"developer-experience\" tabindex=\"-1\">Developer Experience <a class=\"header-anchor\" href=\"https://jono.nz/2019/04/19/waka-cloud-native/#developer-experience\">#</a></h3>\n<p>The developer experience has been vastly improved because no config is required to get started. This was done by making a number of assumptions:</p>\n<ul>\n<li>Use local disk instead of DynamoDB for configuration locally.</li>\n<li>Assume SQL Server is running in Docker, but is configurable.</li>\n<li>Missing API Keys will disable external requests.</li>\n<li>waka-importer does not need to be called directly.</li>\n<li>Auto-discovery of regions.</li>\n<li>Disabled import of line shapes into S3.</li>\n</ul>\n<p>With the split into multiple components, it was important to keep the development experience as good as a monolith - developing in Docker containers is not fun. Originally, I thought this was going to be difficult to do - we need multiple waka-workers for each city. I didn't want to go back to the multi-process mess. Then it hit me. <strong>Every component should be a class that can be instantiated</strong>.</p>\n<p>This is awesome. When it's running locally, the class exposes some routes that are added to waka-orchestrator's router. When it's running in a Docker container, it sets up its own web server, and grabs config from environmental variables.</p>\n<h3 id=\"cloud-native\" tabindex=\"-1\">Cloud Native <a class=\"header-anchor\" href=\"https://jono.nz/2019/04/19/waka-cloud-native/#cloud-native\">#</a></h3>\n<p>With each component being a Docker container, we now run Waka on Amazon ECS. We chose ECS over Kubernetes, because ECS is easier and cheaper to get set-up with. I also spend a lot of time working with Kubernetes at work, so I'm fully aware that it's a much better system!</p>\n<p><img src=\"https://jono.nz/images/waka-ecs.png\" alt=\"Waka ECS Services\"></p>\n<p>waka-orchestrator speaks to the Amazon ECS API to adjust the active version, as well as launching Fargate waka-importer tasks. For bonus points, our SQL server instance also runs on ECS with an EBS mount (there's only timetables in there), and our cluster runs on 75% spot instances! Our stage environment runs on 100% spot instances, and auto-scales so is only available when we're awake.</p>\n<p><img src=\"https://jono.nz/images/waka-alb.png\" alt=\"Waka ALB Routes\"></p>\n<p>As waka has been designed in a way where no components actually talk to each other (apart from waka-proxy, which is doing auto-discovery), we effectively have a zero-trust network. All the components sit behind an Amazon Application Load Balancer (ALB), with routes to the ECS target groups. We also have the Waka admin console on the ALB, but using <a href=\"https://auth0.com\">Auth0</a> to authenticate these requests on the Load Balancer.</p>\n<h2 id=\"help-us-build-waka\" tabindex=\"-1\">Help us build Waka! <a class=\"header-anchor\" href=\"https://jono.nz/2019/04/19/waka-cloud-native/#help-us-build-waka\">#</a></h2>\n<p>With these changes, Waka is ready for the future. We've got new cities in the pipeline and other exciting ideas!</p>\n<p>If you want to help us build Waka, you can now get going in a matter of minutes. Check out the <a href=\"https://github.com/dymajo/waka\">front-end</a> or <a href=\"https://github.com/dymajo/waka-server\">server</a> to get started.</p>\n",
			"date_published": "2019-04-19T12:15:00Z"
		}
		,
		{
			"id": "https://jono.nz/2019/03/10/devlog-2019-02/",
			"url": "https://jono.nz/2019/03/10/devlog-2019-02/",
			"title": "Dev Log: Febuary &amp; March 2019",
			"content_html": "<p>Oops. I've been a bit busy and forgot to do the dev log. As well as going on holiday, I've now &quot;ungraduated&quot; and now I'm an engineer on the Kubernetes team at <a href=\"https://xero.com\">Xero</a>. It's fun though, and I also made a logo for the team:</p>\n<p><img src=\"https://jono.nz/images/platform.png\" alt=\"Xero Compute Platform Logo\"></p>\n<h2 id=\"waka\" tabindex=\"-1\">Waka <a class=\"header-anchor\" href=\"https://jono.nz/2019/03/10/devlog-2019-02/#waka\">#</a></h2>\n<p><a href=\"https://play.google.com/store/apps/details?id=com.dymajo.waka\">Waka is now in the Google Play Store!</a> It's a trusted web activity, so it's really just a PWA running in Chrome. The only difference between the Play Store and <a href=\"https://waka.app\">waka.app</a> is an adaptive icon, but I might add more system integration in the future.</p>\n<p>I've also been working on rewriting the server. Currently it's a bit of a weird monolith that uses subprocesses, but I'm moving it to use containers. The idea is that when you run it in the cloud, it's all load balanced and nice, but still just works when developing it on a single computer.</p>\n<p>I'm going to be going into more depth in my next post, so stay tuned!</p>\n<h2 id=\"nitro\" tabindex=\"-1\">Nitro <a class=\"header-anchor\" href=\"https://jono.nz/2019/03/10/devlog-2019-02/#nitro\">#</a></h2>\n<p>After receiving the first round of feedback, I realized that priorities and Magic Sort were missing from Nitro 3. I've now added both these features to Nitro 3, and they work great!</p>\n<p><img src=\"https://jono.nz/images/magicsort.png\" alt=\"Nitro 3 Magic Sort\"></p>\n<p>I find Magic Sort is really good when you have a large list with deadlines, dates, and priorities, and just need to know what to do first. Magic Sort was already built into the Today list, but you can now activate it on any list.</p>\n<p>The second round of beta invites has also been sent, and I'll be looking to send a third round in a couple of weeks!</p>\n",
			"date_published": "2019-03-10T18:45:00Z"
		}
		,
		{
			"id": "https://jono.nz/2019/01/17/devlog-2019-01/",
			"url": "https://jono.nz/2019/01/17/devlog-2019-01/",
			"title": "Dev Log: January 2019",
			"content_html": "<p>Happy New Year!</p>\n<h2 id=\"nitro-3\" tabindex=\"-1\">Nitro 3 ⚡ <a class=\"header-anchor\" href=\"https://jono.nz/2019/01/17/devlog-2019-01/#nitro-3\">#</a></h2>\n<p>I've sent the first couple of invites to the Nitro 3 private beta. It looks like everything went smoothly - the emails went out, and people were able to sign in and start using Nitro.</p>\n<p><img src=\"https://jono.nz/images/nitro-2019-beta-wave-1.png\" alt=\"Nitro Beta Wave 1 Sent\"></p>\n<p>A couple of things happened to get Nitro to production: I fixed all the critical bugs, added JS Module support, but also had to build a new component to onboard new users. It ended up being pretty simple - if you have a valid invite code, you can login, and it'll set some metadata on your user in Auth0. If you try to login to Nitro without having activated your account (and thus having no metadata), it'll tell you that you don't have access to the application.</p>\n<p>I also added a rudimentary stats page for Admin users, as I decided not to add Google Analytics. At the moment, it's just a count of the lists, tasks, users, and archived tasks in Nitro, but is still useful. I implemented this properly too - it doesn't just connect straight to the database, but calls the Nitro API authenticating as a machine.</p>\n<p>It's common in a lot of environments to not have any authentication and simply trust other traffic because it's coming from the same network. The problem with this approach is that it's not only hard to audit what is requesting what, but ties you a little bit more into your cloud provider (peering VPCs can be a pain). If you use machine to machine authentication, you don't need to build a BFF (your private and public APIs are the same) but you can also make requests over a zero trust network. For example, I could run Nitro API as a container on AWS and Account Manager as a serverless function on Azure with no special networking. Auth0 made this really easy to do - you can grant an application access to an API by just flicking a switch and choosing some scopes.</p>\n<p>I've been using Nitro for months in a test environment - it's always a good idea to dogfood your own app! However, I didn't have any production infrastructure deployed. I've been using <a href=\"https://terraform.io\">Terraform</a> to provision infrastructure, so deploying to production was as easy as renaming some configuration. I would highly recommend everyone to check out Terraform - you write your infrastructure as code, and it'll be built out like magic, even over multiple cloud server providers.</p>\n<p><img src=\"https://jono.nz/images/ecs-cluster-2019-jan.png\" alt=\"Nitro ECS Cluster\"></p>\n<p>Nitro itself is running on AWS, on an ECS Cluster (EC2 launch type) behind a load balancer. The Nitro client is deployed into a S3 bucket, sitting behind Cloudflare. Currently, all the Docker containers are running on a single instance, but I'll add some auto scaling when I onboard a few more people. Additionally, the database is fully managed by AWS (Postgres RDS), and again, I'm using Auth0 to provide login. This is all aided by Nitro being fully functional while offline, so if there is an outage, it's unlikely you'll even notice it 😁.</p>\n<p>In terms of what's next, I'm actually not sure! I'll definitely be checking out the feedback from the first beta users, as well as onboarding more people. Based off the feedback, I'll be able to prioritize the most important issues, and go from there!</p>\n<h2 id=\"waka\" tabindex=\"-1\">Waka <a class=\"header-anchor\" href=\"https://jono.nz/2019/01/17/devlog-2019-01/#waka\">#</a></h2>\n<p>Because I actually managed to run out of things to do on Nitro, I put a little bit of work into Waka. After choosing a line on the lines screen, it'll show the live vehicle locations if there's any! It'll also show the services you can transfer to at each stop. I then removed the existing route map that is visible when you press route map on the stations page - it now sends you to the unified lines page.</p>\n<p><img src=\"https://jono.nz/images/waka-unified-lines-2019-jan.png\" alt=\"Waka Unified Lines - Screenshot of OuterLink\"></p>\n<p>This change is live for both Auckland and Wellington, and works for buses and trains!</p>\n<p>I'm definitely going to make it better though - here's a couple of plans for that page:</p>\n<ul>\n<li>Show transfers at transport hubs (e.g Otahuhu, Albany, Kilbirnie)</li>\n<li>Show how long it takes between stations</li>\n<li>A better way to select the route variant (e.g The NX1 can run to either Albany or the Hibiscus Coast, the 1 can run to one of three possible destinations)</li>\n</ul>\n<p>And if you've jumped in from the station page, or have selected a station:</p>\n<ul>\n<li>Show the live service info</li>\n<li>Show the time that a service yields at each station</li>\n</ul>\n<p>Once that work is all done, it should lead into a few other changes. Notably, showing the inactive stops on the station page, and making transport hubs more prominent on the map. There's also other work where we're disassembling the Waka monolith (okay, it's not really a monolith, but we want to split out the data import from the runtime).</p>\n<hr>\n<p>That's all for January. I'm off to take a well needed holiday! ✈</p>\n",
			"date_published": "2019-01-17T12:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2018/12/27/devlog-2018-12/",
			"url": "https://jono.nz/2018/12/27/devlog-2018-12/",
			"title": "Dev Log: December 2018",
			"content_html": "<p>Here's the last update for 2018!</p>\n<h2 id=\"waka\" tabindex=\"-1\">Waka <a class=\"header-anchor\" href=\"https://jono.nz/2018/12/27/devlog-2018-12/#waka\">#</a></h2>\n<p>I didn't work on Waka this month as I wanted to focus on Nitro. However, I did finish the analysis on Auckland routes - check out the post if you haven't already. /2018/12/15/aucklandservicelength/</p>\n<h2 id=\"nitro-3\" tabindex=\"-1\">Nitro 3 <a class=\"header-anchor\" href=\"https://jono.nz/2018/12/27/devlog-2018-12/#nitro-3\">#</a></h2>\n<p>The big thing this month is keyboard shortcuts. I took some inspiration from Slack and Instant Search on Windows, and put that experience into Nitro. You can now hit Ctrl+K, type, and jump straight into any list or task. You can also quickly navigate through your tasks, reorder them, and either triage them for today, or mark them as complete. Nitro isn't 100% keyboard accessible yet, but I would really like to get there in the future. There's also a nice modal which has quick reference to all the shortcuts.</p>\n<p><img src=\"https://jono.nz/images/nitro-2018-dec-keyboardshortcuts.png\" alt=\"Nitro Keyboard Shortcuts\"></p>\n<p>I also cleaned up all the rough edges of the Auth0 implementation. You'll now be redirected to the login page if your authentication does expire, and usually it just passes you all the way through and back to Nitro. I've also made sure the other Nitro Sync bits such as the WebSockets and BroadcastChannel play nicely with Auth0. It's a pretty seamless experience, and I would highly recommend using Auth0 for your own project.</p>\n<p>I've also fixed a lot of bugs, and added a number of quality of life improvements. The big one is that assets are now stored properly on a CDN. Combined with Service Workers, this means that Nitro loads really fast, and works when you are 100% offline. I wasn't intending to, but ending up vastly improving the speed of the task overlay, so it's now really smooth on my little Surface Go.</p>\n<p>Over the next month I want to fix the final remaining issues:</p>\n<ul>\n<li>Fix the the remaining bugs on mobile</li>\n<li>Improve the sync on slow connections</li>\n<li>Find and fix any last bugs!</li>\n</ul>\n<p>Expect to see the initial beta invites to be sent out in January 2019!</p>\n",
			"date_published": "2018-12-27T09:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2018/12/15/aucklandservicelength/",
			"url": "https://jono.nz/2018/12/15/aucklandservicelength/",
			"title": "Which transit services in Auckland travel the furthest?",
			"content_html": "<p>I got this question a couple of weeks ago, and I realized I was in a pretty good position to answer it. Waka already has all the required data in it, so it was a matter of writing a couple of SQL queries.</p>\n<p>These results were obtained for the week of November 5th - 11th, 2018. All routes are bus routes if not specified otherwise.</p>\n<h2 id=\"what-are-the-longest-routes-in-auckland\" tabindex=\"-1\">What are the longest routes in Auckland? <a class=\"header-anchor\" href=\"https://jono.nz/2018/12/15/aucklandservicelength/#what-are-the-longest-routes-in-auckland\">#</a></h2>\n<p>The first question is simple - what are the longest routes in Auckland (school buses excluded).</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Code</th>\n<th style=\"text-align:left\">Route Description</th>\n<th style=\"text-align:right\">Length (km)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/125X\">125X</a></td>\n<td style=\"text-align:left\">Helensville To City Centre Via Westgate Express</td>\n<td style=\"text-align:right\">58.96</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/396\">396</a></td>\n<td style=\"text-align:left\">Pukekohe Interchange To Waiuku Loop Via Patumahoe</td>\n<td style=\"text-align:right\">49.49</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/SKY\">SKY</a></td>\n<td style=\"text-align:left\">Airport To Albany - <em>Commercial Bus</em></td>\n<td style=\"text-align:right\">47.68</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/399\">399</a></td>\n<td style=\"text-align:left\">Pukekohe To Port Waikato Via Tuakau</td>\n<td style=\"text-align:right\">44.21</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/171X\">171X</a></td>\n<td style=\"text-align:left\">City Centre To New Lynn Via Laingholm</td>\n<td style=\"text-align:right\">39.23</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/125\">125</a></td>\n<td style=\"text-align:left\">Helensville To Westgate</td>\n<td style=\"text-align:right\">38.48</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/997\">997</a></td>\n<td style=\"text-align:left\">Warkworth To Omaha Via Matakana And Port Wells</td>\n<td style=\"text-align:right\">37.60</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/395\">395</a></td>\n<td style=\"text-align:left\">Waiuku To Papakura Interchange</td>\n<td style=\"text-align:right\">35.70</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/N11\">N11</a></td>\n<td style=\"text-align:left\">City To Papakura Via Great South Rd - <em>Night Bus</em></td>\n<td style=\"text-align:right\">34.47</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/120\">120</a></td>\n<td style=\"text-align:left\">Akoranga to Henderson</td>\n<td style=\"text-align:right\">32.82</td>\n</tr>\n</tbody>\n</table>\n<p><a href=\"https://jono.nz/files/aucklandservicelength/routeDistance.csv\">Full Results</a> · <a href=\"https://jono.nz/files/aucklandservicelength/routeDistance.sql\">SQL Queries</a></p>\n<p>These results are not particularly interesting. The majority of the above services are semi rural, and don't have great frequency.</p>\n<h2 id=\"what-are-the-shortest-routes-in-auckland\" tabindex=\"-1\">What are the shortest routes in Auckland? <a class=\"header-anchor\" href=\"https://jono.nz/2018/12/15/aucklandservicelength/#what-are-the-shortest-routes-in-auckland\">#</a></h2>\n<p>Ignoring the weird routes that aren't really routes (i.e short running services) and school buses, here are the shortest routes in Auckland.</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Code</th>\n<th style=\"text-align:left\">Route Description</th>\n<th style=\"text-align:right\">Length (km)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/SBAY\">SBAY</a></td>\n<td style=\"text-align:left\">Auckland To Stanley Bay - <em>Ferry</em></td>\n<td style=\"text-align:right\">2.17</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/BAYS\">BAYS</a></td>\n<td style=\"text-align:left\">Bayswater To Auckland - <em>Ferry</em></td>\n<td style=\"text-align:right\">2.35</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/DEV\">DEV</a></td>\n<td style=\"text-align:left\">Auckland To Devonport - <em>Ferry</em></td>\n<td style=\"text-align:right\">3.11</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/890\">890</a></td>\n<td style=\"text-align:left\">Albany Station To Corinthian Dr Loop</td>\n<td style=\"text-align:right\">3.51</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/987\">987</a></td>\n<td style=\"text-align:left\">Arkles Bay Loop</td>\n<td style=\"text-align:right\">3.80</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/BIRK\">BIRK</a></td>\n<td style=\"text-align:left\">Auckland To Birkenhead Via Northcote Point - <em>Ferry</em></td>\n<td style=\"text-align:right\">4.08</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/161\">161</a></td>\n<td style=\"text-align:left\">New Lynn to Brains Park</td>\n<td style=\"text-align:right\">4.17</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/807\">807</a></td>\n<td style=\"text-align:left\">Devonport Wharf To Cheltenham Loop</td>\n<td style=\"text-align:right\">4.21</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/842\">842</a></td>\n<td style=\"text-align:left\">Smales Farm Station To Crown Hill Via East Coast Rd</td>\n<td style=\"text-align:right\">4.44</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/889\">889</a></td>\n<td style=\"text-align:left\">Constellation Station To Albany Station Via Hugh Green Dr</td>\n<td style=\"text-align:right\">5.18</td>\n</tr>\n</tbody>\n</table>\n<p>It's interesting to see that there are no services under 2km, and most of these short services are ferries or local loops.</p>\n<h2 id=\"which-routes-in-auckland-have-most-services-per-week\" tabindex=\"-1\">Which routes in Auckland have most services per week. <a class=\"header-anchor\" href=\"https://jono.nz/2018/12/15/aucklandservicelength/#which-routes-in-auckland-have-most-services-per-week\">#</a></h2>\n<p>This includes both short/long running services - there's no good way split them out.</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Route</th>\n<th style=\"text-align:right\">Services per Week</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/NX1\">NX1</a></td>\n<td style=\"text-align:right\">2687</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/NX2\">NX2</a></td>\n<td style=\"text-align:right\">1788</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/INN\">InnerLink</a></td>\n<td style=\"text-align:right\">1490</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/70\">70</a></td>\n<td style=\"text-align:right\">1427</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/SKY\">SkyBus</a> - <em>Commercial Bus</em></td>\n<td style=\"text-align:right\">1387</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/18\">18</a></td>\n<td style=\"text-align:right\">1379</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/OUT\">OuterLink</a></td>\n<td style=\"text-align:right\">1304</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/82\">82</a></td>\n<td style=\"text-align:right\">1164</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/CTY\">CityLink</a></td>\n<td style=\"text-align:right\">1164</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/25B\">25B</a></td>\n<td style=\"text-align:right\">1147</td>\n</tr>\n</tbody>\n</table>\n<p><a href=\"https://jono.nz/files/aucklandservicelength/servicesPerWeek.csv\">Full Results</a> · <a href=\"https://jono.nz/files/aucklandservicelength/servicesPerWeek.sql\">SQL Queries</a></p>\n<p>The NX1 has the most services by far, but there's also a lot of services that start halfway through the route. The InnerLink &amp; OuterLink is also fairly high (and the real frequency is high), but because they're weird loops the route can be split into a bunch of segments (the smallest being 900m).</p>\n<p>The SkyBus is deceiving, because there's essentially 3 routes under the same code - Albany to Airport, City to Airport via Mt Eden Road, and City to Airport via Dominion Road.</p>\n<h2 id=\"which-transit-services-in-auckland-travel-the-furthest-each-week\" tabindex=\"-1\">Which transit services in Auckland travel the furthest each week? <a class=\"header-anchor\" href=\"https://jono.nz/2018/12/15/aucklandservicelength/#which-transit-services-in-auckland-travel-the-furthest-each-week\">#</a></h2>\n<p>Now we'll combine the number of services with how far they go, grouping by the route code.</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Route</th>\n<th style=\"text-align:right\">Distance Traveled per Week (km)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/NX1\">NX1</a></td>\n<td style=\"text-align:right\">57,378</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/SKY\">SkyBus</a> - <em>Commerical Bus</em></td>\n<td style=\"text-align:right\">55,605</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/OUT\">OuterLink</a></td>\n<td style=\"text-align:right\">32,326</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/NX2\">NX2</a></td>\n<td style=\"text-align:right\">32,118</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/70\">70</a></td>\n<td style=\"text-align:right\">30,257</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/380\">380</a></td>\n<td style=\"text-align:right\">30,233</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/STH\">Southern Line</a> - <em>Train</em></td>\n<td style=\"text-align:right\">28,070</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/WEST\">Western Line</a> - <em>Train</em></td>\n<td style=\"text-align:right\">25,143</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/EAST\">Eastern Line</a> - <em>Train</em></td>\n<td style=\"text-align:right\">21,872</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><a href=\"https://waka.app/l/nz-akl/83\">83</a></td>\n<td style=\"text-align:right\">21,153</td>\n</tr>\n</tbody>\n</table>\n<p><a href=\"https://jono.nz/files/aucklandservicelength/kmPerWeek.csv\">Full Results</a> · <a href=\"https://jono.nz/files/aucklandservicelength/kmPerWeek.sql\">SQL Queries</a></p>\n<p>The NX1 comes out on top - the frequency is good, and as it travels a long distance on the busway and motorway. In many ways the SkyBus is similar - it travels quite far on the busway and motorway with good frequency, but it is a little deceiving as mentioned earlier.</p>\n<p>It's not surprising to see some of our long frequent routes in here too - OUT, NX2, 70, and 83. Our trains also make an appearance - while the frequency is not as good as some of our bus network, the trains tend to travel longer distances.</p>\n<p>The most interesting apperance in here is the 380. It is not classified as a frequent service, but it has 15-20 minute service all day. As it is an airport bus, it starts extremely early (4:40am) and ends very late (12:40am) every day. It's also a bit of a silly route - it really should be split into two halves - Airport to Manukau, and Airport to Onehunga/Mangere.</p>\n",
			"date_published": "2018-12-15T12:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2018/11/25/devlog-2018-11/",
			"url": "https://jono.nz/2018/11/25/devlog-2018-11/",
			"title": "Dev Log: November 2018",
			"content_html": "<p>This is the second installment of the dev log. Let's see if we can keep this streak going!</p>\n<h2 id=\"waka\" tabindex=\"-1\">Waka <a class=\"header-anchor\" href=\"https://jono.nz/2018/11/25/devlog-2018-11/#waka\">#</a></h2>\n<p>I've made some improvements to health checks - they now check if the realtime data is working in Auckland. It's still at <a href=\"https://assets-us-west-2.waka.app/status/index.html\">https://assets-us-west-2.waka.app/status/index.html</a>, but will eventually be rolled into the app.</p>\n<p><img src=\"https://jono.nz/images/waka-2018-healthchecks.jpg\" alt=\"SMS Notifications for Health Checks\"></p>\n<p>SMS notifications now trigger when the health checks fail (super simple with Amazon SNS), so I'll know a lot sooner if Waka is down.</p>\n<p>I'm also trying to answer the question &quot;What routes in Auckland travel the most km per week?&quot;. I should have the answer to that tomorrow, and I'll do a little bit of a writeup.</p>\n<p>Other than that, there's been nothing done in actual Waka. Matt hasn't done anything on <code>waka-importer</code> either.</p>\n<h2 id=\"nitro-3\" tabindex=\"-1\">Nitro 3 <a class=\"header-anchor\" href=\"https://jono.nz/2018/11/25/devlog-2018-11/#nitro-3\">#</a></h2>\n<p>I've spent most of my time coding Nitro this month.</p>\n<p><img src=\"https://jono.nz/images/nitro-2018-sync-indicator.png\" alt=\"Nitro Sync Indicator\"></p>\n<p>The overlay position is now fixed - no matter where it's opened from. However, it's a bit laggy in some browsers (Edge), and can be laggy on Retina screens. I'll fix it eventually, but not for the initial release. There's also a new sync indicator - when a task is syncing, an icon shows up.</p>\n<p>The biggest change is from my own custom username/password auth to <a href=\"https://auth0.com\">Auth0</a>. It provides a decent user experience, and I don't have to worry about other things such as sign up, 2FA, and OAuth. Unfortunately it seems to log you out a lot, but it's not a huge deal as it's only a single click to log back in.</p>\n<p>I also fixed a couple of other bugs and papercuts:</p>\n<ul>\n<li>Added the sign out button back</li>\n<li>Added proper error messages on the login page</li>\n<li>Upgraded all dependencies</li>\n<li>Fixed the list ordering without all list</li>\n<li>Fixed a race condition when notes were being saved</li>\n</ul>\n<p>Next month, I want to continue to focus on fixing bugs and improve the performance on slower machines and phones. I also want the sync to be a bit better - stopping your browser from closing if sync is in progress, and triggering a sync if you haven't been using Nitro for some time. Oh, and I still need to add the settings menu.</p>\n<hr>\n<p>That's it for November! If you have any questions, flick them through to me on <a href=\"https://twitter.com/consindo\">Twitter</a>, and I'll try answer them in the next post.</p>\n",
			"date_published": "2018-11-25T09:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2018/10/22/devlog-2018-10/",
			"url": "https://jono.nz/2018/10/22/devlog-2018-10/",
			"title": "Dev Log: October 2018",
			"content_html": "<p>I haven't been posting on this blog for a while, but I have been doing things. I'm going to aim to do one of these dev logs every month or so. The idea is that I'll be more accountable and maybe even release something.</p>\n<p>Anyway, here's what I've been doing over the last little bit.</p>\n<h2 id=\"waka\" tabindex=\"-1\">Waka <a class=\"header-anchor\" href=\"https://jono.nz/2018/10/22/devlog-2018-10/#waka\">#</a></h2>\n<p>We ended up running out of Azure Credits, and decided to move Waka to AWS. It's generally a lot cheaper, and as I use AWS at Xero, I'm pretty familiar with how to Terraform the bits and pieces together. We had to switch from Azure Blob Storage to S3, and move from a maps server to static map tiles in a S3 Bucket. Other than that, it went fine.</p>\n<p><a href=\"https://mattdavidson.kiwi\">Matt</a> is supposed to be working on <a href=\"https://github.com/dymajo/waka-importer\">waka-importer</a>. The idea is that you input a GTFS file, and it'll dump everything to a SQL Database Dump &amp; Upload Shapes to S3. Hopefully, this should make Waka a bit more modular. It's mostly just extracting the existing functionality into a standalone app, so it should be done pretty soon.</p>\n<p><img src=\"https://jono.nz/images/wakastatus.png\" alt=\"Waka Status Page\"></p>\n<p>Waka now has a <a href=\"https://assets-us-west-2.waka.app/status/index.html\">status page</a>. It's pretty rough right now, but it'll be integrated into service alerts when we add them in. This will probably happen pretty soon because I now live in Wellington, and it seems that every time I go try and catch a train, it's been replaced by a bus.</p>\n<p>In terms of a roadmap, the next things coming will be a new unified lines view, service alerts, and hopefully a switch to Docker containers.</p>\n<h2 id=\"nitro-3\" tabindex=\"-1\">Nitro 3 <a class=\"header-anchor\" href=\"https://jono.nz/2018/10/22/devlog-2018-10/#nitro-3\">#</a></h2>\n<p>I'm still working on Nitro! I get a lot of emails asking when Nitro 3 is coming, and the only thing I can say is &quot;soon&quot;.</p>\n<p>Nitro has taken a long time to build for a number of reasons. Firstly, it's trying to ship an interface that feels native on both mobile &amp; desktop. The end result is great - a single screen, like most native apps. However, it's much more difficult than building something in Bootstrap, with no animations, and calling it a day.</p>\n<p>The second reason for the slow development is the syncing. Nitro works perfectly offline, and it will merge changes when you go back online. I decided to write my own sync code with a standard postgres database, but definitely ran into more issues than I had envisioned.</p>\n<p>Lastly, I don't have enough time. I'm not a uni student anymore, and have less time to work on things. This will hopefully change when Nitro is released and is earning a little bit of money, but for now, I have to balance it around other things.</p>\n<p>Anyway, here's what Nitro looks like right now:</p>\n<p><img src=\"https://jono.nz/images/nitro-2018-oct-mobile.png\" alt=\"Nitro Mobile\"></p>\n<p>And here it is on the desktop:</p>\n<p><img src=\"https://jono.nz/images/nitro-2018-oct-desktop.png\" alt=\"Nitro Desktop\"></p>\n<p>As you can see, it's taken a little bit of inspiration from Waka - that user interface works really well on mobile. It's also very easy to adapt it to the desktop.</p>\n<p>At the moment, I'm working on the expanded task. While the inside is done, there's quite a few weird bugs when you try open a task from a fresh reload, search, or click too fast. For performance reasons, it's rendered as an overlay, rather than inline with an expanding height, but it does make things a bit weird.</p>\n<p>Other than that, the next task is to finish off sync (add an indicator + fix edge cases), and add a little more polish (papercuts + settings + sign up). I haven't been adding features for some time now because I want to get a release out the door. If you haven't already, you can sign up for the beta at <a href=\"http://nitrotasks.com\">nitrotasks.com</a>.</p>\n<hr>\n<p>That's it for this month! If you have any questions, flick them through to me on <a href=\"https://twitter.com/consindo\">Twitter</a>, and I'll try answer them in the next post.</p>\n",
			"date_published": "2018-10-22T09:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2018/04/02/turbolinks/",
			"url": "https://jono.nz/2018/04/02/turbolinks/",
			"title": "Turbolinks",
			"content_html": "<p>Single Page Routing is cool, because it allows your pages to load without incurring the cost a full load. It can be difficult to set up, but I would recommend checking out <a href=\"https://github.com/turbolinks/turbolinks\">Turbolinks</a>. You can Single Page Routing running on your existing site in like, twenty minutes. It's great.</p>\n<p>It's a tiny little script that you just have to insert into your <code>&lt;head&gt;</code>, and it swaps out the body whenever you follow a link. It prevents your CSS and JS from being redownloaded, so you don't get an unsightly white flash when your page loads.</p>\n<p>This site is already pretty fast, as it uses <a href=\"https://hexo.io\">Hexo</a> to render the site out statically, but I still added Turbolinks, and now it's even faster.</p>\n<p>The process was also pretty simple for this site:</p>\n<ul>\n<li>Add script tag</li>\n<li>Move other script tags to the head, with a <code>defer</code> attribute.</li>\n<li>Realize that my script only queries the elements once, so I needed to add a <code>data-turbolinks-permanent</code> to my navigation element.\n<br></li>\n</ul>\n<p>And I think that's it. It's really great for sites that don't use a lot of JavaScript.</p>\n<p><a href=\"https://github.com/turbolinks/turbolinks\">https://github.com/turbolinks/turbolinks</a></p>\n",
			"date_published": "2018-04-02T10:28:17Z"
		}
		,
		{
			"id": "https://jono.nz/2018/02/25/transit-part2/",
			"url": "https://jono.nz/2018/02/25/transit-part2/",
			"title": "How does Waka work? - Part 2",
			"content_html": "<p>Finally, part two of this guide! In part two, we'll go over how the frontend works. I managed to keep <a href=\"https://jono.nz/2017/10/08/transit-part1/\">part one</a> reasonably well updated, but contact me if you have any issues.</p>\n<h2 id=\"setting-up\" tabindex=\"-1\">Setting Up <a class=\"header-anchor\" href=\"https://jono.nz/2018/02/25/transit-part2/#setting-up\">#</a></h2>\n<p>If you've already set up the server, it'll all good to go! If not, you'll need node.js &amp; npm installed - https://nodejs.org. Then, three easy steps:</p>\n<ul>\n<li>First, get the code with <code>git clone https://github.com/consindo/waka.git</code></li>\n<li>Install dependencies with <code>npm install</code></li>\n<li>Build the client with  <code>npm run build</code></li>\n</ul>\n<h2 id=\"development\" tabindex=\"-1\">Development <a class=\"header-anchor\" href=\"https://jono.nz/2018/02/25/transit-part2/#development\">#</a></h2>\n<p>If you're only working on the frontend code, and don't want to go to the hassle of setting up your own server, you can simply use <code>npm run watch:live</code>. If you have the server set up, you can use <code>npm run watch</code> instead.</p>\n<p>Waka uses Webpack, so you get all the fancy live reloading - just head to http://locahost:8009. In terms of code style, eslint &amp; prettier are all set up - just run it through them before you send a pull request.</p>\n<h2 id=\"react\" tabindex=\"-1\">React <a class=\"header-anchor\" href=\"https://jono.nz/2018/02/25/transit-part2/#react\">#</a></h2>\n<p>Waka is written in React, with React Router for the single page routing. If adding a new page or view, it's super important to make sure it can be accessed with a URL - this is how the back button works on Android.</p>\n<p>For maps, Waka uses the DYMAJO OpenStreetMap Server, because it's too expensive to use Mapbox or something similar. We're currently using Leaflet with react-leaflet, but this will be replaced with mapbox-gl-js in the near future.</p>\n<p>Lots of stuff in Waka is custom because most React components are designed for the desktop. 90% of Traffic to Waka is from mobile, so make sure always build mobile first. Often, I like to plug in my phone and debug directly on that.</p>\n<h2 id=\"scss\" tabindex=\"-1\">SCSS <a class=\"header-anchor\" href=\"https://jono.nz/2018/02/25/transit-part2/#scss\">#</a></h2>\n<p>It's all custom. It's also a little bit of a mess, because the app has undergone a number of significant redesigns in its 1.5 year history. A new redesign is coming soon, so I'll do my best to clean it up a little more.</p>\n<h2 id=\"speed\" tabindex=\"-1\">Speed <a class=\"header-anchor\" href=\"https://jono.nz/2018/02/25/transit-part2/#speed\">#</a></h2>\n<p>Waka uses Service Workers to run offline, and it falls back nicely. It's not very useful offline, but at least it will load when you're running out of the house and there's very bad Wi-Fi. Bundle size is also reasonably well optimized, so use dynamic imports if necessary.</p>\n<p>There's also the percieved speed - the app uses a large amount of animation in an effort to make things feel faster. If you think something needs an animation, please add it!</p>\n<h2 id=\"now-what\" tabindex=\"-1\">Now what? <a class=\"header-anchor\" href=\"https://jono.nz/2018/02/25/transit-part2/#now-what\">#</a></h2>\n<p>Please download the code and mess around! It's much easier to get started with the client than the server, so if there's something you're dying to fix or add, it would be greatly appreciated.</p>\n<p>Any questions, suggestions, or issues - <a href=\"http://localhost:4000/me/\">contact me!</a></p>\n<p>https://github.com/consindo/waka</p>\n",
			"date_published": "2018-02-25T19:56:43Z"
		}
		,
		{
			"id": "https://jono.nz/2017/10/08/transit-part1/",
			"url": "https://jono.nz/2017/10/08/transit-part1/",
			"title": "How does Waka work? - Part 1",
			"content_html": "<p>Matt keeps asking me how Waka works, so I’ve decided to write a guide. In Part 1, we go over how the server does things. I’ll try make an effort to keep this guide updated - contact me if it’s not.</p>\n<h2 id=\"the-server-stack\" tabindex=\"-1\">The Server Stack <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#the-server-stack\">#</a></h2>\n<p>Before you even try to start Waka, you’ll need:</p>\n<ul>\n<li>Windows or Linux (I develop on Windows, production on Linux)</li>\n<li>Node.js https://nodejs.org</li>\n<li>Microsoft SQL Server http://downloadsqlserverexpress.com</li>\n<li>Azure Storage Emulator https://azure.microsoft.com/en-us/downloads/</li>\n<li>Git https://git-scm.com/</li>\n</ul>\n<h3 id=\"handy-tools\" tabindex=\"-1\">Handy Tools <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#handy-tools\">#</a></h3>\n<ul>\n<li>SQL Server Management Studio (install when installing SQL Server) - Windows only though.</li>\n<li>Azure Storage Explorer (don’t use it a lot but it can be handy) https://azure.microsoft.com/en-us/features/storage-explorer/</li>\n</ul>\n<h3 id=\"third-party-api-s\" tabindex=\"-1\">Third Party API’s <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#third-party-api-s\">#</a></h3>\n<ul>\n<li>Auckland Transport (if you want Auckland to work) https://dev-portal.at.govt.nz/</li>\n<li>Sendgrid (to get the send a link emails working) https://sendgrid.com/</li>\n<li>Azure Application Insights (only for production) https://azure.microsoft.com/en-us/services/application-insights/</li>\n</ul>\n<h2 id=\"configuration\" tabindex=\"-1\">Configuration <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#configuration\">#</a></h2>\n<ul>\n<li>First, get the code with <code>git clone https://github.com/consindo/waka.git</code></li>\n<li>Install dependencies with <code>npm install</code></li>\n<li>Build the client with  <code>npm run build</code></li>\n</ul>\n<h3 id=\"config-js\" tabindex=\"-1\">/config.js <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#config-js\">#</a></h3>\n<p>This is app wide config. Defaults should be fine, but change the public &amp; private ports if required. Make sure you don’t expose the private port to the web! You can also disable auto updates / worker management of cities by adjusting the <code>autoupdate</code> entry.</p>\n<h3 id=\"server-master-db-config-master-js-config-slave-js\" tabindex=\"-1\">/server-master/db/config-master.js, config-slave.js <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#server-master-db-config-master-js-config-slave-js\">#</a></h3>\n<p>These are where the app looks for database connection strings. Make your SQL Server install allows SQL Server Authentication, and TCP/IP Network Protocol is enabled. The user set in <code>config-master.js</code> must be allowed to Create Databases, and the user set in <code>config-slave.js</code> must be allowed to access and modify the created database. You will need an already created database in <code>config-master.js</code>, but this is not needed for the slave.</p>\n<p>By default, workers in the workers table use the dbconfig of <code>slave</code>, but you can set this to <code>whatever</code> if you want to use <code>config-whatever.js</code> (if you need to distribute over multiple instances of SQL Server).</p>\n<h3 id=\"environmental-variables\" tabindex=\"-1\">Environmental Variables <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#environmental-variables\">#</a></h3>\n<ul>\n<li><code>AZURE_STORAGE_ACCOUNT</code> - the Azure Storage Account. For the emulator, use: <code>devstoreaccount1</code></li>\n<li><code>AZURE_STORAGE_ACCESS_KEY</code> - the Azure Storage Account Key. For the emulator, use:\n<code>Eby8vdM02xNOcqFlqUwJPLlmEtlCDXJ1OUzFT50uSRZ6IFsuFq2UVErCz4I6tq/K1SZFPTOtr/KBHBeksoGMGw==</code></li>\n<li><code>atApiKey</code> - the Auckland Transport API Key (optional if you don’t want Auckland)</li>\n<li><code>SENDGRID_API_KEY</code> for emails (optional)</li>\n<li><code>AZURE_INSIGHTS</code> for insights (optional)</li>\n<li><code>AGENDA21_API_KEY</code> currently a private key, returns parking information for Auckland Carparks (optional)</li>\n</ul>\n<h2 id=\"starting\" tabindex=\"-1\">Starting <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#starting\">#</a></h2>\n<p>Yay! You’ve configured Waka. Run <code>node index.js</code> to start, and it’ll create the database and start on the port you specified.</p>\n<p>If you don’t want it to start downloading data from Auckland automatically, make sure you disable the auto updates in <code>/config.js</code>.</p>\n<h2 id=\"architecture\" tabindex=\"-1\">Architecture <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#architecture\">#</a></h2>\n<p>Waka has a master process that manages a collection of worker processes, each encapsulating a particular region &amp; version and providing the API. Each worker process uses its own database which keeps things smaller, faster, and is easier to delete when the data has expired. There’s mapping functionality which sends all requests to a particular region to a particular version. If you’re using the auto importers you shouldn’t have to worry about the mappings, but it is possible to override.</p>\n<p>Worker spawning is done through node’s <code>child_process.fork</code>, and all communication thereafter is done through a standard REST API - using both the public and private methods on both the master and the worker. Requests are proxied through to the mapped worker from the master. Check out all the router files for further details.</p>\n<p>Static rendering and hosting of assets is done through yet another process. For static rendering, it uses the standard public REST API, and transforms the JSON to HTML. Files in <code>/dist</code> are all hosted under <code>/</code> when a route cannot be found. If a file is not found in <code>/dist</code>, the static server returns a default or 404 page, and lets the client side JavaScript take over the rest.</p>\n<h2 id=\"server-master-private-api\" tabindex=\"-1\">Server-Master Private API <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#server-master-private-api\">#</a></h2>\n<p>If you’re not using an auto importer or just need to emergency fix things, you can do so with the private API. It’s not secured, so you have to make sure the port isn’t exposed.</p>\n<p>For most of these requests, just pop a JSON object with the prefix (region) and version in the request body.</p>\n<p><strong>Update</strong>: You can now just head to <a href=\"http://localhost:8001\">http://localhost:8001</a> and there's a nice UI for running these request.</p>\n<ul>\n<li><code>GET /worker</code> - Returns all the available workers.</li>\n<li><code>POST /worker/add</code> - Send a prefix, version to create a new worker.</li>\n<li><code>POST /worker/load</code> - Load workers from the database again (generally shouldn’t use this)</li>\n<li><code>POST /worker/start</code> - Send a prefix, version to start a particular worker.</li>\n<li><code>POST /worker/startall</code> - Starts all workers that have startpolicy ‘auto’</li>\n<li><code>POST /worker/stop</code> - Stops a worker process.</li>\n<li><code>POST /worker/delete</code> - Stops a worker, and then deletes it from the database.</li>\n<li><code>GET  /mapping</code> - Shows which prefixes are mapped to which workers.</li>\n<li><code>POST /mapping/load</code> - Loads mappings from the database again (generally shouldn’t use this)</li>\n<li><code>POST /mapping/set</code> - Send a prefix and a version to set the worker where requests are forwarded.</li>\n<li><code>POST /mapping/delete</code> - Unmaps a prefix - requests to a region will 404 after being deleted.</li>\n<li><code>POST /import-start/:mode</code> - Trigger a manual import of GTFS data. Use <code>db</code> for the database import, <code>shapes</code> for the Azure Shapes Parse &amp; Upload, or <code>all</code> for both.</li>\n<li><code>POST /import-complete</code> - Used internally from the worker - tells master that an import has completed so it can update the database and run any callbacks.</li>\n</ul>\n<h2 id=\"server-worker-and-server-static-public-api\" tabindex=\"-1\">Server-Worker &amp; Server-Static Public API <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#server-worker-and-server-static-public-api\">#</a></h2>\n<p>This is the public API. You can generate them with <code>npm run document</code> or just head to <a href=\"https://waka.app/docs/index.html\">https://waka.app/docs/index.html</a>.</p>\n<h2 id=\"sql-migrations\" tabindex=\"-1\">SQL Migrations <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#sql-migrations\">#</a></h2>\n<p>Because we create the database from scratch every time a new worker is created, we don’t have to worry about migrations! Simply delete the worker and try again if you’re having any issues. The SQL files which create the tables and stored procedures are located in <code>/server-worker/db/procs</code></p>\n<p>I’m not sure how to do the migrations for the master database yet, but the scripts that create it on first run are in <code>/server-master/db/procs</code></p>\n<h2 id=\"tests\" tabindex=\"-1\">Tests <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#tests\">#</a></h2>\n<p>No unit tests yet 😢. There’s a couple of tests in the Auckland auto importer that does a quick check before changing the live mapping, but that’s it. There’s definitely room for improvement here.</p>\n<h2 id=\"other-things\" tabindex=\"-1\">Other Things <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#other-things\">#</a></h2>\n<p>Here’s some things you might want to do when modifying or using Waka as a dev.</p>\n<h3 id=\"adding-a-new-city\" tabindex=\"-1\">Adding a New City <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#adding-a-new-city\">#</a></h3>\n<ul>\n<li>Add an importer with countrycode-airportcode as the prefix in <code>/server-worker/importers</code></li>\n<li>Use the private API to add, start, run the importer, and set the mapping to your version.</li>\n<li>Fix anything that’s broken when you try use that city.\n<ul>\n<li>Lines requires special config.</li>\n<li>Realtime also requires special config.</li>\n<li>Stations, Stop Times, and Timetable should be pretty smooth sailing.</li>\n</ul>\n</li>\n<li>Add an auto importer to keep versions &amp; mappings up to date.</li>\n<li>Send a pull request!</li>\n</ul>\n<h2 id=\"now-what\" tabindex=\"-1\">Now what? <a class=\"header-anchor\" href=\"https://jono.nz/2017/10/08/transit-part1/#now-what\">#</a></h2>\n<p>Hopefully you download the code and have a play - fix a few issues, or even just file some 😃 https://github.com/consindo/waka/issues</p>\n<p>In <a href=\"https://jono.nz/2018/02/25/transit-part2/\">Part 2</a>, we’ll go over the client-side development.</p>\n",
			"date_published": "2017-10-08T19:56:43Z"
		}
		,
		{
			"id": "https://jono.nz/2016/12/30/ioshacks/",
			"url": "https://jono.nz/2016/12/30/ioshacks/",
			"title": "Mobile Safari Hacks",
			"content_html": "<p>While developing <a href=\"https://waka.app\">Waka</a>, I've discovered that Mobile Safari is the new IE6. Most of this arises because Apple has layered on a number of fancy features that work great for most sites, but create problems when you trying making a web app. Here's a couple of issues and fixes for these things:</p>\n<h2 id=\"desktop-safari-is-completely-different-to-mobile-safari\" tabindex=\"-1\">Desktop Safari is completely different to Mobile Safari <a class=\"header-anchor\" href=\"https://jono.nz/2016/12/30/ioshacks/#desktop-safari-is-completely-different-to-mobile-safari\">#</a></h2>\n<p><strong>Problem:</strong> Desktop Safari looks great, but the app doesn't work on iOS.\n<strong>Solution:</strong> Unfortunately, you always have to be testing on real devices. This goes for Android too, because these devices are a lot slower than your dev machine.</p>\n<p><img src=\"https://jono.nz/images/throttle.png\" alt=\"Chrome CPU Throttling\"></p>\n<p>It's also a good idea to enable CPU Throttling in Chrome in order to get an idea of how your app will perform.</p>\n<h2 id=\"viewport-height-is-too-high\" tabindex=\"-1\">Viewport Height is too high <a class=\"header-anchor\" href=\"https://jono.nz/2016/12/30/ioshacks/#viewport-height-is-too-high\">#</a></h2>\n<p><strong>Problem:</strong> 100vh includes the height of the browser controls, which are overlaid so there's the fancy blur effect.</p>\n<p><img src=\"https://jono.nz/images/ios-vh-issue.png\" alt=\"iOS Viewport Height Issue\" title=\"Image from https://nicolas-hoizey.com/2015/02/viewport-height-is-taller-than-the-visible-part-of-the-document-in-some-mobile-browsers.html\"></p>\n<p><strong>Fix:</strong> If you can't use height 100%, I would recommend using a CSS variable, and line of code like this:</p>\n<pre><code>document.body.style.setProperty('--real-height', document.documentElement.clientHeight + 'px')\n</code></pre>\n<p>Make sure to bind this to your window.onresize event!</p>\n<h2 id=\"no-kinetic-scrolling-in-child-elements\" tabindex=\"-1\">No Kinetic Scrolling in Child Elements <a class=\"header-anchor\" href=\"https://jono.nz/2016/12/30/ioshacks/#no-kinetic-scrolling-in-child-elements\">#</a></h2>\n<p><strong>Problem:</strong> Having overflow:scroll in a container doesn't have any inertia.\n<strong>Solution:</strong> On your element, set <code>-webkit-overflow-scrolling: touch;</code></p>\n<h2 id=\"webkit-overflow-scrolling-bubbles-to-page\" tabindex=\"-1\">-webkit-overflow-scrolling bubbles to page <a class=\"header-anchor\" href=\"https://jono.nz/2016/12/30/ioshacks/#webkit-overflow-scrolling-bubbles-to-page\">#</a></h2>\n<p><strong>Problem:</strong> When you're at the top of the element, the entire page scrolls, not the element.\n<strong>Solution:</strong> You'll need two elements, something like this:</p>\n<pre><code>&lt;div class=&quot;scrollable&quot;&gt;\n  &lt;div class=&quot;container&quot;&gt;\n    Content\n  &lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n<p>On the inner element, you'll need to set <code>min-height: 101%</code>. Then, <code>onTouchStart</code>, you'll need some JavaScript that moves the scroll position down a single pixel at the top of the page, or up a pixel at the bottom.</p>\n<pre><code>let top = e.scrollTop\nlet totalScroll = e.scrollHeight\nlet currentScroll = top + e.offsetHeight\n \nif (top === 0) {\n  e.scrollTop = 1\n} else if (currentScroll === totalScroll) {\n  e.scrollTop = top - 1\n}\n</code></pre>\n<h2 id=\"flexbox-is-funky-in-row-direction\" tabindex=\"-1\">Flexbox is funky in row direction <a class=\"header-anchor\" href=\"https://jono.nz/2016/12/30/ioshacks/#flexbox-is-funky-in-row-direction\">#</a></h2>\n<p><strong>Problem:</strong> Flexbox generally doesn't work in the row direction on iOS.\n<strong>Solution:</strong> If setting the container height with the CSS variable you made doesn't work, use <code>calc()</code> with that variable. It's really not ideal, but this is what I've found works best.</p>\n<h2 id=\"force-touch\" tabindex=\"-1\">Force Touch <a class=\"header-anchor\" href=\"https://jono.nz/2016/12/30/ioshacks/#force-touch\">#</a></h2>\n<p><strong>Problem:</strong> If you force touch on an link that you styled like a button because you have fancy single page routing, it'll pop up a preview.\n<strong>Solution:</strong> If iOS, don't use the anchor tag (or at least a href). Bind an event to the button, <a href=\"https://developer.mozilla.org/en/docs/Web/API/History\">and push the new URL to the History</a>.</p>\n<h2 id=\"no-caching-when-pinned-to-home-screen\" tabindex=\"-1\">No caching when pinned to home screen <a class=\"header-anchor\" href=\"https://jono.nz/2016/12/30/ioshacks/#no-caching-when-pinned-to-home-screen\">#</a></h2>\n<p><strong>Problem:</strong> There's no HTTP caching when the app is pinned to home screen. Makes for long initial load times.\n<strong>Solution:</strong> You're gonna have to use <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Using_the_application_cache\">AppCache</a> for this one.</p>\n<p>That's all I can think of for now. If you have a Mobile Safari hack, message me, and I'll add it to this post!</p>\n",
			"date_published": "2016-12-30T08:30:00Z"
		}
		,
		{
			"id": "https://jono.nz/2016/08/31/xps13/",
			"url": "https://jono.nz/2016/08/31/xps13/",
			"title": "XPS 13 vs Surface",
			"content_html": "<p>I recently bought a Dell XPS 13, to replace my Surface Pro 3. These devices roughly cost the same, but I managed to snag a last generation XPS with the improved screen for the same price as a current generation with the regular HD display. I miss out on USB-C and improved graphics, but that's not a huge deal.</p>\n<p>While both of these devices are a generation behind, they're very similar to the current model, so this comparison is still valid.</p>\n<p><img src=\"https://jono.nz/images/xps13.jpg\" alt=\"My XPS 13\"></p>\n<h2 id=\"what-the-xps-does-better\" tabindex=\"-1\">What the XPS does better <a class=\"header-anchor\" href=\"https://jono.nz/2016/08/31/xps13/#what-the-xps-does-better\">#</a></h2>\n<ul>\n<li>\n<p><strong>Screen</strong> This is the best part of the XPS 13. The 3200x1800 resolution is great, and apps like Photoshop look great at 200% scaling. There's more pixels on this thing than the 15&quot; MacBook Pro! Oh, and the tiny bezels are beautiful.</p>\n</li>\n<li>\n<p><strong>Battery</strong> Even with the crazy screen, the XPS lasts 9 hours. The Surface with a fresh battery only lasts 5 hours. The power management also seems a lot better - the Surface always used to randomly turn on in my bag.</p>\n</li>\n<li>\n<p><strong>Connectivity</strong> The XPS has an extra USB port, lock slot and a full sized SD card reader. The newer model even has Thunderbolt over USB-C! Oh, and if you thought Broadcom Wi-Fi was bad, the Atheros chip in the Surface will drive your head through a wall.</p>\n</li>\n</ul>\n<h2 id=\"what-the-surface-does-better\" tabindex=\"-1\">What the Surface does better <a class=\"header-anchor\" href=\"https://jono.nz/2016/08/31/xps13/#what-the-surface-does-better\">#</a></h2>\n<ul>\n<li>\n<p><strong>Stylus</strong> The Surface has pen support, which works really well. It's great if you want to annotate things, or draw. However, I find paper better because you can spread it around on a table and refer back a bit easier. Oh, and since printing is an enormous hassle, I just handwrite my assignments anyway. ¯\\_(ツ)_/¯</p>\n</li>\n<li>\n<p><strong>Keyboard</strong> The Type Cover 4 is less mushy, even though it has less travel.</p>\n</li>\n<li>\n<p><strong>Audio</strong> The Surface has front facing speakers and never any software issues. On the XPS, very occasionally headphones aren't detected or the sound quality deteriorates (a reboot fixes this).</p>\n</li>\n</ul>\n<h2 id=\"things-other-people-have-issues-with\" tabindex=\"-1\">Things other people have issues with <a class=\"header-anchor\" href=\"https://jono.nz/2016/08/31/xps13/#things-other-people-have-issues-with\">#</a></h2>\n<ul>\n<li><strong>Webcam</strong> The XPS 13 has stupid webcam placement, but I use my phone for video calling.</li>\n<li><strong>Form Factor</strong> The Surface is also a tablet.</li>\n<li><strong>Windows Hello</strong> Only the Surface Pro 4 has this, but it's really cool.</li>\n<li><strong>Windows 10 Pro</strong> The Surface comes with it, but I had a spare license for my XPS.</li>\n</ul>\n<h2 id=\"what-both-could-do-better\" tabindex=\"-1\">What both could do better <a class=\"header-anchor\" href=\"https://jono.nz/2016/08/31/xps13/#what-both-could-do-better\">#</a></h2>\n<ul>\n<li>\n<p><strong>Trackpad</strong> The trackpad on the Type Cover 4 is too small. The XPS 13 doesn't support four finger gestures. I just wish I could switch desktops with 3 fingers. There's also a lot of apps in Windows that don't handle precision scrolling well *<em>cough</em>* <em>Electron</em> *<em>cough</em>*.</p>\n</li>\n<li>\n<p><strong>Windows 10</strong> Sometimes Windows Explorer messes up and I can't use instant search. It's very annoying, and I need to restart the process.</p>\n</li>\n</ul>\n<h2 id=\"the-verdict\" tabindex=\"-1\">The Verdict <a class=\"header-anchor\" href=\"https://jono.nz/2016/08/31/xps13/#the-verdict\">#</a></h2>\n<p>I like the XPS more, if only because of the nicer screen and significantly better battery. If a tablet and stylus is important to you, get a Surface.</p>\n",
			"date_published": "2016-08-31T22:00:00Z"
		}
		,
		{
			"id": "https://jono.nz/2016/07/17/hi/",
			"url": "https://jono.nz/2016/07/17/hi/",
			"title": "This is my awesome website",
			"content_html": "<p>Hi, I'm Jono. I've had a couple of blogs over the years, but they tend to disappear as I abandon side projects and domain names. I finally have a domain name that I like, so I've decided to build a proper website. I haven't completely finished yet, but the aim is to have all my work, projects, and writing in one place.</p>\n<p><img src=\"https://jono.nz/images/hi.jpg\" alt=\"Picture of Jono\"></p>\n<p>Who am I? Well, that page isn't done yet, but I'm a student currently living in Auckland, New Zealand. At the moment, I study Computer Science &amp; Applied Mathematics at the University of Auckland. On the side, I build websites for other people, make apps and travel the world.</p>\n<p>I'm currently building a beautiful FTP + SFTP app for Windows 10. It's not released yet, but you can check it out and sign up to the beta at <a href=\"https://dymajo.com\">dymajo.com</a>.</p>\n<p>That's really it for now. Feel free to copy and share anything written on the blog, with attribution. The website design and source code is also freely available on <a href=\"https://github.com\">GitHub</a>. Do whatever you like with it, but linking back is highly appreciated.</p>\n",
			"date_published": "2016-07-17T16:54:21Z"
		}
		
	]
}
